GopalSaraf/Practicals/PSDL/include/proc/pic18f25q10.h
extern volatile CWGPPSbits_t CWGPPSbits __at(0xEAC);
// bitfield macros
#define _CWGPPS_PIN_POSN                                    0x0
#define _CWGPPS_PIN_POSITION                                0x0
#define _CWGPPS_PIN_SIZE                                    0x3
#define _CWGPPS_PIN_LENGTH                                  0x3
#define _CWGPPS_PIN_MASK                                    0x7
#define _CWGPPS_PORT_POSN                                   0x3
#define _CWGPPS_PORT_POSITION                               0x3
#define _CWGPPS_PORT_SIZE                                   0x2
#define _CWGPPS_PORT_LENGTH                                 0x2
#define _CWGPPS_PORT_MASK                                   0x18
#define _CWGPPS_CWGINPPS0_POSN                              0x0
#define _CWGPPS_CWGINPPS0_POSITION                          0x0
#define _CWGPPS_CWGINPPS0_SIZE                              0x1
#define _CWGPPS_CWGINPPS0_LENGTH                            0x1
#define _CWGPPS_CWGINPPS0_MASK                              0x1
#define _CWGPPS_CWGINPPS1_POSN                              0x1
#define _CWGPPS_CWGINPPS1_POSITION                          0x1
#define _CWGPPS_CWGINPPS1_SIZE                              0x1
#define _CWGPPS_CWGINPPS1_LENGTH                            0x1
#define _CWGPPS_CWGINPPS1_MASK                              0x2
#define _CWGPPS_CWGINPPS2_POSN                              0x2
#define _CWGPPS_CWGINPPS2_POSITION                          0x2
#define _CWGPPS_CWGINPPS2_SIZE                              0x1
#define _CWGPPS_CWGINPPS2_LENGTH                            0x1
#define _CWGPPS_CWGINPPS2_MASK                              0x4
#define _CWGPPS_CWGINPPS3_POSN                              0x3
#define _CWGPPS_CWGINPPS3_POSITION                          0x3
#define _CWGPPS_CWGINPPS3_SIZE                              0x1
#define _CWGPPS_CWGINPPS3_LENGTH                            0x1
#define _CWGPPS_CWGINPPS3_MASK                              0x8
#define _CWGPPS_CWGINPPS4_POSN                              0x4
#define _CWGPPS_CWGINPPS4_POSITION                          0x4
#define _CWGPPS_CWGINPPS4_SIZE                              0x1
#define _CWGPPS_CWGINPPS4_LENGTH                            0x1
#define _CWGPPS_CWGINPPS4_MASK                              0x10
#define _CWGPPS_CWG1INPPS_POSN                              0x0
#define _CWGPPS_CWG1INPPS_POSITION                          0x0
#define _CWGPPS_CWG1INPPS_SIZE                              0x5
#define _CWGPPS_CWG1INPPS_LENGTH                            0x5
#define _CWGPPS_CWG1INPPS_MASK                              0x1F
#define _CWGPPS_CWG1INPPS0_POSN                             0x0
#define _CWGPPS_CWG1INPPS0_POSITION                         0x0
#define _CWGPPS_CWG1INPPS0_SIZE                             0x1
#define _CWGPPS_CWG1INPPS0_LENGTH                           0x1
#define _CWGPPS_CWG1INPPS0_MASK                             0x1
#define _CWGPPS_CWG1INPPS1_POSN                             0x1
#define _CWGPPS_CWG1INPPS1_POSITION                         0x1
#define _CWGPPS_CWG1INPPS1_SIZE                             0x1
#define _CWGPPS_CWG1INPPS1_LENGTH                           0x1
#define _CWGPPS_CWG1INPPS1_MASK                             0x2
#define _CWGPPS_CWG1INPPS2_POSN                             0x2
#define _CWGPPS_CWG1INPPS2_POSITION                         0x2
#define _CWGPPS_CWG1INPPS2_SIZE                             0x1
#define _CWGPPS_CWG1INPPS2_LENGTH                           0x1
#define _CWGPPS_CWG1INPPS2_MASK                             0x4
#define _CWGPPS_CWG1INPPS3_POSN                             0x3
#define _CWGPPS_CWG1INPPS3_POSITION                         0x3
#define _CWGPPS_CWG1INPPS3_SIZE                             0x1
#define _CWGPPS_CWG1INPPS3_LENGTH                           0x1
#define _CWGPPS_CWG1INPPS3_MASK                             0x8
#define _CWGPPS_CWG1INPPS4_POSN                             0x4
#define _CWGPPS_CWG1INPPS4_POSITION                         0x4
#define _CWGPPS_CWG1INPPS4_SIZE                             0x1
#define _CWGPPS_CWG1INPPS4_LENGTH                           0x1
#define _CWGPPS_CWG1INPPS4_MASK                             0x10
#define _CWGPPS_CWGINPPS_POSN                               0x0
#define _CWGPPS_CWGINPPS_POSITION                           0x0
#define _CWGPPS_CWGINPPS_SIZE                               0x5
#define _CWGPPS_CWGINPPS_LENGTH                             0x5
#define _CWGPPS_CWGINPPS_MASK                               0x1F
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned CWGINPPS0              :1;
        unsigned CWGINPPS1              :1;
        unsigned CWGINPPS2              :1;
        unsigned CWGINPPS3              :1;
        unsigned CWGINPPS4              :1;
    };
    struct {
        unsigned CWG1INPPS              :5;
    };
    struct {
        unsigned CWG1INPPS0             :1;
        unsigned CWG1INPPS1             :1;
        unsigned CWG1INPPS2             :1;
        unsigned CWG1INPPS3             :1;
        unsigned CWG1INPPS4             :1;
    };
    struct {
        unsigned CWGINPPS               :5;
    };
} CWGINPPSbits_t;
extern volatile CWGINPPSbits_t CWGINPPSbits __at(0xEAC);
// bitfield macros
#define _CWGINPPS_PIN_POSN                                  0x0
#define _CWGINPPS_PIN_POSITION                              0x0
#define _CWGINPPS_PIN_SIZE                                  0x3
#define _CWGINPPS_PIN_LENGTH                                0x3
#define _CWGINPPS_PIN_MASK                                  0x7
#define _CWGINPPS_PORT_POSN                                 0x3
#define _CWGINPPS_PORT_POSITION                             0x3
#define _CWGINPPS_PORT_SIZE                                 0x2
#define _CWGINPPS_PORT_LENGTH                               0x2
#define _CWGINPPS_PORT_MASK                                 0x18
#define _CWGINPPS_CWGINPPS0_POSN                            0x0
#define _CWGINPPS_CWGINPPS0_POSITION                        0x0
#define _CWGINPPS_CWGINPPS0_SIZE                            0x1
#define _CWGINPPS_CWGINPPS0_LENGTH                          0x1
#define _CWGINPPS_CWGINPPS0_MASK                            0x1
#define _CWGINPPS_CWGINPPS1_POSN                            0x1
#define _CWGINPPS_CWGINPPS1_POSITION                        0x1
#define _CWGINPPS_CWGINPPS1_SIZE                            0x1
#define _CWGINPPS_CWGINPPS1_LENGTH                          0x1
#define _CWGINPPS_CWGINPPS1_MASK                            0x2
#define _CWGINPPS_CWGINPPS2_POSN                            0x2
#define _CWGINPPS_CWGINPPS2_POSITION                        0x2
#define _CWGINPPS_CWGINPPS2_SIZE                            0x1
#define _CWGINPPS_CWGINPPS2_LENGTH                          0x1
#define _CWGINPPS_CWGINPPS2_MASK                            0x4
#define _CWGINPPS_CWGINPPS3_POSN                            0x3
#define _CWGINPPS_CWGINPPS3_POSITION                        0x3
#define _CWGINPPS_CWGINPPS3_SIZE                            0x1
#define _CWGINPPS_CWGINPPS3_LENGTH                          0x1
#define _CWGINPPS_CWGINPPS3_MASK                            0x8
#define _CWGINPPS_CWGINPPS4_POSN                            0x4
#define _CWGINPPS_CWGINPPS4_POSITION                        0x4
#define _CWGINPPS_CWGINPPS4_SIZE                            0x1
#define _CWGINPPS_CWGINPPS4_LENGTH                          0x1
#define _CWGINPPS_CWGINPPS4_MASK                            0x10
#define _CWGINPPS_CWG1INPPS_POSN                            0x0
#define _CWGINPPS_CWG1INPPS_POSITION                        0x0
#define _CWGINPPS_CWG1INPPS_SIZE                            0x5
#define _CWGINPPS_CWG1INPPS_LENGTH                          0x5
#define _CWGINPPS_CWG1INPPS_MASK                            0x1F
#define _CWGINPPS_CWG1INPPS0_POSN                           0x0
#define _CWGINPPS_CWG1INPPS0_POSITION                       0x0
#define _CWGINPPS_CWG1INPPS0_SIZE                           0x1
#define _CWGINPPS_CWG1INPPS0_LENGTH                         0x1
#define _CWGINPPS_CWG1INPPS0_MASK                           0x1
#define _CWGINPPS_CWG1INPPS1_POSN                           0x1
#define _CWGINPPS_CWG1INPPS1_POSITION                       0x1
#define _CWGINPPS_CWG1INPPS1_SIZE                           0x1
#define _CWGINPPS_CWG1INPPS1_LENGTH                         0x1
#define _CWGINPPS_CWG1INPPS1_MASK                           0x2
#define _CWGINPPS_CWG1INPPS2_POSN                           0x2
#define _CWGINPPS_CWG1INPPS2_POSITION                       0x2
#define _CWGINPPS_CWG1INPPS2_SIZE                           0x1
#define _CWGINPPS_CWG1INPPS2_LENGTH                         0x1
#define _CWGINPPS_CWG1INPPS2_MASK                           0x4
#define _CWGINPPS_CWG1INPPS3_POSN                           0x3
#define _CWGINPPS_CWG1INPPS3_POSITION                       0x3
#define _CWGINPPS_CWG1INPPS3_SIZE                           0x1
#define _CWGINPPS_CWG1INPPS3_LENGTH                         0x1
#define _CWGINPPS_CWG1INPPS3_MASK                           0x8
#define _CWGINPPS_CWG1INPPS4_POSN                           0x4
#define _CWGINPPS_CWG1INPPS4_POSITION                       0x4
#define _CWGINPPS_CWG1INPPS4_SIZE                           0x1
#define _CWGINPPS_CWG1INPPS4_LENGTH                         0x1
#define _CWGINPPS_CWG1INPPS4_MASK                           0x10
#define _CWGINPPS_CWGINPPS_POSN                             0x0
#define _CWGINPPS_CWGINPPS_POSITION                         0x0
#define _CWGINPPS_CWGINPPS_SIZE                             0x5
#define _CWGINPPS_CWGINPPS_LENGTH                           0x5
#define _CWGINPPS_CWGINPPS_MASK                             0x1F
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned CWGINPPS0              :1;
        unsigned CWGINPPS1              :1;
        unsigned CWGINPPS2              :1;
        unsigned CWGINPPS3              :1;
        unsigned CWGINPPS4              :1;
    };
    struct {
        unsigned CWG1INPPS              :5;
    };
    struct {
        unsigned CWG1INPPS0             :1;
        unsigned CWG1INPPS1             :1;
        unsigned CWG1INPPS2             :1;
        unsigned CWG1INPPS3             :1;
        unsigned CWG1INPPS4             :1;
    };
    struct {
        unsigned CWGINPPS               :5;
    };
} CWG1INPPSbits_t;
