GopalSaraf/Practicals/PSDL/include/proc/pic18f25q10.h
// Register: IPR4
#define IPR4 IPR4
extern volatile unsigned char           IPR4                __at(0xEB9);
#ifndef _LIB_BUILD
asm("IPR4 equ 0EB9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1IP                 :1;
        unsigned TMR2IP                 :1;
        unsigned TMR3IP                 :1;
        unsigned TMR4IP                 :1;
        unsigned TMR5IP                 :1;
        unsigned TMR6IP                 :1;
    };
    struct {
        unsigned CCIP3IP                :1;
    };
} IPR4bits_t;
extern volatile IPR4bits_t IPR4bits __at(0xEB9);
// bitfield macros
#define _IPR4_TMR1IP_POSN                                   0x0
#define _IPR4_TMR1IP_POSITION                               0x0
#define _IPR4_TMR1IP_SIZE                                   0x1
#define _IPR4_TMR1IP_LENGTH                                 0x1
#define _IPR4_TMR1IP_MASK                                   0x1
#define _IPR4_TMR2IP_POSN                                   0x1
#define _IPR4_TMR2IP_POSITION                               0x1
#define _IPR4_TMR2IP_SIZE                                   0x1
#define _IPR4_TMR2IP_LENGTH                                 0x1
#define _IPR4_TMR2IP_MASK                                   0x2
#define _IPR4_TMR3IP_POSN                                   0x2
#define _IPR4_TMR3IP_POSITION                               0x2
#define _IPR4_TMR3IP_SIZE                                   0x1
#define _IPR4_TMR3IP_LENGTH                                 0x1
#define _IPR4_TMR3IP_MASK                                   0x4
#define _IPR4_TMR4IP_POSN                                   0x3
#define _IPR4_TMR4IP_POSITION                               0x3
#define _IPR4_TMR4IP_SIZE                                   0x1
#define _IPR4_TMR4IP_LENGTH                                 0x1
#define _IPR4_TMR4IP_MASK                                   0x8
#define _IPR4_TMR5IP_POSN                                   0x4
#define _IPR4_TMR5IP_POSITION                               0x4
#define _IPR4_TMR5IP_SIZE                                   0x1
#define _IPR4_TMR5IP_LENGTH                                 0x1
#define _IPR4_TMR5IP_MASK                                   0x10
#define _IPR4_TMR6IP_POSN                                   0x5
#define _IPR4_TMR6IP_POSITION                               0x5
#define _IPR4_TMR6IP_SIZE                                   0x1
#define _IPR4_TMR6IP_LENGTH                                 0x1
#define _IPR4_TMR6IP_MASK                                   0x20
#define _IPR4_CCIP3IP_POSN                                  0x0
#define _IPR4_CCIP3IP_POSITION                              0x0
#define _IPR4_CCIP3IP_SIZE                                  0x1
#define _IPR4_CCIP3IP_LENGTH                                0x1
#define _IPR4_CCIP3IP_MASK                                  0x1

// Register: IPR5
#define IPR5 IPR5
extern volatile unsigned char           IPR5                __at(0xEBA);
#ifndef _LIB_BUILD
asm("IPR5 equ 0EBAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1GIP                :1;
        unsigned TMR3GIP                :1;
        unsigned TMR5GIP                :1;
    };
    struct {
        unsigned CCH05                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned CCH15                  :1;
    };
} IPR5bits_t;
extern volatile IPR5bits_t IPR5bits __at(0xEBA);
// bitfield macros
#define _IPR5_TMR1GIP_POSN                                  0x0
#define _IPR5_TMR1GIP_POSITION                              0x0
#define _IPR5_TMR1GIP_SIZE                                  0x1
#define _IPR5_TMR1GIP_LENGTH                                0x1
#define _IPR5_TMR1GIP_MASK                                  0x1
#define _IPR5_TMR3GIP_POSN                                  0x1
#define _IPR5_TMR3GIP_POSITION                              0x1
#define _IPR5_TMR3GIP_SIZE                                  0x1
#define _IPR5_TMR3GIP_LENGTH                                0x1
#define _IPR5_TMR3GIP_MASK                                  0x2
#define _IPR5_TMR5GIP_POSN                                  0x2
#define _IPR5_TMR5GIP_POSITION                              0x2
#define _IPR5_TMR5GIP_SIZE                                  0x1
#define _IPR5_TMR5GIP_LENGTH                                0x1
#define _IPR5_TMR5GIP_MASK                                  0x4
#define _IPR5_CCH05_POSN                                    0x0
#define _IPR5_CCH05_POSITION                                0x0
#define _IPR5_CCH05_SIZE                                    0x1
#define _IPR5_CCH05_LENGTH                                  0x1
#define _IPR5_CCH05_MASK                                    0x1
#define _IPR5_CCH15_POSN                                    0x1
#define _IPR5_CCH15_POSITION                                0x1
#define _IPR5_CCH15_SIZE                                    0x1
#define _IPR5_CCH15_LENGTH                                  0x1
#define _IPR5_CCH15_MASK                                    0x2

// Register: IPR6
#define IPR6 IPR6
extern volatile unsigned char           IPR6                __at(0xEBB);
#ifndef _LIB_BUILD
asm("IPR6 equ 0EBBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1IP                 :1;
        unsigned CCP2IP                 :1;
    };
} IPR6bits_t;
extern volatile IPR6bits_t IPR6bits __at(0xEBB);
// bitfield macros
#define _IPR6_CCP1IP_POSN                                   0x0
#define _IPR6_CCP1IP_POSITION                               0x0
#define _IPR6_CCP1IP_SIZE                                   0x1
#define _IPR6_CCP1IP_LENGTH                                 0x1
#define _IPR6_CCP1IP_MASK                                   0x1
#define _IPR6_CCP2IP_POSN                                   0x1
#define _IPR6_CCP2IP_POSITION                               0x1
#define _IPR6_CCP2IP_SIZE                                   0x1
#define _IPR6_CCP2IP_LENGTH                                 0x1
#define _IPR6_CCP2IP_MASK                                   0x2

// Register: IPR7
#define IPR7 IPR7
extern volatile unsigned char           IPR7                __at(0xEBC);
#ifndef _LIB_BUILD
asm("IPR7 equ 0EBCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CWGIP                  :1;
        unsigned                        :4;
        unsigned NVMIP                  :1;
        unsigned CRCIP                  :1;
        unsigned SCANIP                 :1;
    };
    struct {
        unsigned CWG1IP                 :1;
    };
} IPR7bits_t;
