GopalSaraf/Practicals/PSDL/include/proc/pic18f25q10.h
extern volatile __bit                   CWG1DBF1            __at(0x79F1);	// @ (0xF3E * 8 + 1)
#define                                 CWG1DBF1_bit        _BIT_ACCESS(CWG1DBF,1)
// CWG1DBF<CWG1DBF2>
extern volatile __bit                   CWG1DBF2            __at(0x79F2);	// @ (0xF3E * 8 + 2)
#define                                 CWG1DBF2_bit        _BIT_ACCESS(CWG1DBF,2)
// CWG1DBF<CWG1DBF3>
extern volatile __bit                   CWG1DBF3            __at(0x79F3);	// @ (0xF3E * 8 + 3)
#define                                 CWG1DBF3_bit        _BIT_ACCESS(CWG1DBF,3)
// CWG1DBF<CWG1DBF4>
extern volatile __bit                   CWG1DBF4            __at(0x79F4);	// @ (0xF3E * 8 + 4)
#define                                 CWG1DBF4_bit        _BIT_ACCESS(CWG1DBF,4)
// CWG1DBF<CWG1DBF5>
extern volatile __bit                   CWG1DBF5            __at(0x79F5);	// @ (0xF3E * 8 + 5)
#define                                 CWG1DBF5_bit        _BIT_ACCESS(CWG1DBF,5)
// CWG1DBR<CWG1DBR0>
extern volatile __bit                   CWG1DBR0            __at(0x79E8);	// @ (0xF3D * 8 + 0)
#define                                 CWG1DBR0_bit        _BIT_ACCESS(CWG1DBR,0)
// CWG1DBR<CWG1DBR1>
extern volatile __bit                   CWG1DBR1            __at(0x79E9);	// @ (0xF3D * 8 + 1)
#define                                 CWG1DBR1_bit        _BIT_ACCESS(CWG1DBR,1)
// CWG1DBR<CWG1DBR2>
extern volatile __bit                   CWG1DBR2            __at(0x79EA);	// @ (0xF3D * 8 + 2)
#define                                 CWG1DBR2_bit        _BIT_ACCESS(CWG1DBR,2)
// CWG1DBR<CWG1DBR3>
extern volatile __bit                   CWG1DBR3            __at(0x79EB);	// @ (0xF3D * 8 + 3)
#define                                 CWG1DBR3_bit        _BIT_ACCESS(CWG1DBR,3)
// CWG1DBR<CWG1DBR4>
extern volatile __bit                   CWG1DBR4            __at(0x79EC);	// @ (0xF3D * 8 + 4)
#define                                 CWG1DBR4_bit        _BIT_ACCESS(CWG1DBR,4)
// CWG1DBR<CWG1DBR5>
extern volatile __bit                   CWG1DBR5            __at(0x79ED);	// @ (0xF3D * 8 + 5)
#define                                 CWG1DBR5_bit        _BIT_ACCESS(CWG1DBR,5)
// CWG1CON0<CWG1EN>
extern volatile __bit                   CWG1EN              __at(0x79FF);	// @ (0xF3F * 8 + 7)
#define                                 CWG1EN_bit          _BIT_ACCESS(CWG1CON0,7)
// PIE7<CWG1IE>
extern volatile __bit                   CWG1IE              __at(0x7620);	// @ (0xEC4 * 8 + 0)
#define                                 CWG1IE_bit          _BIT_ACCESS(PIE7,0)
// PIR7<CWG1IF>
extern volatile __bit                   CWG1IF              __at(0x7660);	// @ (0xECC * 8 + 0)
#define                                 CWG1IF_bit          _BIT_ACCESS(PIR7,0)
// CWG1CON1<CWG1IN>
extern volatile __bit                   CWG1IN              __at(0x7A05);	// @ (0xF40 * 8 + 5)
#define                                 CWG1IN_bit          _BIT_ACCESS(CWG1CON1,5)
// CWG1PPS<CWG1INPPS0>
extern volatile __bit                   CWG1INPPS0          __at(0x7560);	// @ (0xEAC * 8 + 0)
#define                                 CWG1INPPS0_bit      _BIT_ACCESS(CWG1PPS,0)
// CWG1PPS<CWG1INPPS1>
extern volatile __bit                   CWG1INPPS1          __at(0x7561);	// @ (0xEAC * 8 + 1)
#define                                 CWG1INPPS1_bit      _BIT_ACCESS(CWG1PPS,1)
// CWG1PPS<CWG1INPPS2>
extern volatile __bit                   CWG1INPPS2          __at(0x7562);	// @ (0xEAC * 8 + 2)
#define                                 CWG1INPPS2_bit      _BIT_ACCESS(CWG1PPS,2)
// CWG1PPS<CWG1INPPS3>
extern volatile __bit                   CWG1INPPS3          __at(0x7563);	// @ (0xEAC * 8 + 3)
#define                                 CWG1INPPS3_bit      _BIT_ACCESS(CWG1PPS,3)
// CWG1PPS<CWG1INPPS4>
extern volatile __bit                   CWG1INPPS4          __at(0x7564);	// @ (0xEAC * 8 + 4)
#define                                 CWG1INPPS4_bit      _BIT_ACCESS(CWG1PPS,4)
// IPR7<CWG1IP>
extern volatile __bit                   CWG1IP              __at(0x75E0);	// @ (0xEBC * 8 + 0)
#define                                 CWG1IP_bit          _BIT_ACCESS(IPR7,0)
// CWG1ISM<CWG1ISM0>
extern volatile __bit                   CWG1ISM0            __at(0x79E0);	// @ (0xF3C * 8 + 0)
#define                                 CWG1ISM0_bit        _BIT_ACCESS(CWG1ISM,0)
// CWG1ISM<CWG1ISM1>
extern volatile __bit                   CWG1ISM1            __at(0x79E1);	// @ (0xF3C * 8 + 1)
#define                                 CWG1ISM1_bit        _BIT_ACCESS(CWG1ISM,1)
// CWG1ISM<CWG1ISM2>
extern volatile __bit                   CWG1ISM2            __at(0x79E2);	// @ (0xF3C * 8 + 2)
#define                                 CWG1ISM2_bit        _BIT_ACCESS(CWG1ISM,2)
// CWG1ISM<CWG1ISM3>
extern volatile __bit                   CWG1ISM3            __at(0x79E3);	// @ (0xF3C * 8 + 3)
#define                                 CWG1ISM3_bit        _BIT_ACCESS(CWG1ISM,3)
// CWG1CON0<CWG1LD>
extern volatile __bit                   CWG1LD              __at(0x79FE);	// @ (0xF3F * 8 + 6)
#define                                 CWG1LD_bit          _BIT_ACCESS(CWG1CON0,6)
// CWG1AS0<CWG1LSAC0>
extern volatile __bit                   CWG1LSAC0           __at(0x7A0A);	// @ (0xF41 * 8 + 2)
#define                                 CWG1LSAC0_bit       _BIT_ACCESS(CWG1AS0,2)
// CWG1AS0<CWG1LSAC1>
extern volatile __bit                   CWG1LSAC1           __at(0x7A0B);	// @ (0xF41 * 8 + 3)
#define                                 CWG1LSAC1_bit       _BIT_ACCESS(CWG1AS0,3)
// CWG1AS0<CWG1LSBD0>
extern volatile __bit                   CWG1LSBD0           __at(0x7A0C);	// @ (0xF41 * 8 + 4)
#define                                 CWG1LSBD0_bit       _BIT_ACCESS(CWG1AS0,4)
// CWG1AS0<CWG1LSBD1>
extern volatile __bit                   CWG1LSBD1           __at(0x7A0D);	// @ (0xF41 * 8 + 5)
#define                                 CWG1LSBD1_bit       _BIT_ACCESS(CWG1AS0,5)
// PMD4<CWG1MD>
extern volatile __bit                   CWG1MD              __at(0x7700);	// @ (0xEE0 * 8 + 0)
#define                                 CWG1MD_bit          _BIT_ACCESS(PMD4,0)
// CWG1CON0<CWG1MODE0>
extern volatile __bit                   CWG1MODE0           __at(0x79F8);	// @ (0xF3F * 8 + 0)
#define                                 CWG1MODE0_bit       _BIT_ACCESS(CWG1CON0,0)
// CWG1CON0<CWG1MODE1>
extern volatile __bit                   CWG1MODE1           __at(0x79F9);	// @ (0xF3F * 8 + 1)
#define                                 CWG1MODE1_bit       _BIT_ACCESS(CWG1CON0,1)
// CWG1CON0<CWG1MODE2>
extern volatile __bit                   CWG1MODE2           __at(0x79FA);	// @ (0xF3F * 8 + 2)
#define                                 CWG1MODE2_bit       _BIT_ACCESS(CWG1CON0,2)
// CWG1STR<CWG1OVRA>
extern volatile __bit                   CWG1OVRA            __at(0x7A1C);	// @ (0xF43 * 8 + 4)
#define                                 CWG1OVRA_bit        _BIT_ACCESS(CWG1STR,4)
// CWG1STR<CWG1OVRB>
extern volatile __bit                   CWG1OVRB            __at(0x7A1D);	// @ (0xF43 * 8 + 5)
#define                                 CWG1OVRB_bit        _BIT_ACCESS(CWG1STR,5)
// CWG1STR<CWG1OVRC>
extern volatile __bit                   CWG1OVRC            __at(0x7A1E);	// @ (0xF43 * 8 + 6)
#define                                 CWG1OVRC_bit        _BIT_ACCESS(CWG1STR,6)
// CWG1STR<CWG1OVRD>
extern volatile __bit                   CWG1OVRD            __at(0x7A1F);	// @ (0xF43 * 8 + 7)
#define                                 CWG1OVRD_bit        _BIT_ACCESS(CWG1STR,7)
// CWG1CON1<CWG1POLA>
extern volatile __bit                   CWG1POLA            __at(0x7A00);	// @ (0xF40 * 8 + 0)
#define                                 CWG1POLA_bit        _BIT_ACCESS(CWG1CON1,0)
// CWG1CON1<CWG1POLB>
extern volatile __bit                   CWG1POLB            __at(0x7A01);	// @ (0xF40 * 8 + 1)
#define                                 CWG1POLB_bit        _BIT_ACCESS(CWG1CON1,1)
// CWG1CON1<CWG1POLC>
extern volatile __bit                   CWG1POLC            __at(0x7A02);	// @ (0xF40 * 8 + 2)
#define                                 CWG1POLC_bit        _BIT_ACCESS(CWG1CON1,2)
// CWG1CON1<CWG1POLD>
extern volatile __bit                   CWG1POLD            __at(0x7A03);	// @ (0xF40 * 8 + 3)
#define                                 CWG1POLD_bit        _BIT_ACCESS(CWG1CON1,3)
// CWG1AS0<CWG1REN>
extern volatile __bit                   CWG1REN             __at(0x7A0E);	// @ (0xF41 * 8 + 6)
#define                                 CWG1REN_bit         _BIT_ACCESS(CWG1AS0,6)
// CWG1AS0<CWG1SHUTDOWN>
extern volatile __bit                   CWG1SHUTDOWN        __at(0x7A0F);	// @ (0xF41 * 8 + 7)
#define                                 CWG1SHUTDOWN_bit    _BIT_ACCESS(CWG1AS0,7)
// CWG1STR<CWG1STRA>
extern volatile __bit                   CWG1STRA            __at(0x7A18);	// @ (0xF43 * 8 + 0)
#define                                 CWG1STRA_bit        _BIT_ACCESS(CWG1STR,0)
// CWG1STR<CWG1STRB>
extern volatile __bit                   CWG1STRB            __at(0x7A19);	// @ (0xF43 * 8 + 1)
#define                                 CWG1STRB_bit        _BIT_ACCESS(CWG1STR,1)
// CWG1STR<CWG1STRC>
extern volatile __bit                   CWG1STRC            __at(0x7A1A);	// @ (0xF43 * 8 + 2)
#define                                 CWG1STRC_bit        _BIT_ACCESS(CWG1STR,2)
// CWG1STR<CWG1STRD>
extern volatile __bit                   CWG1STRD            __at(0x7A1B);	// @ (0xF43 * 8 + 3)
#define                                 CWG1STRD_bit        _BIT_ACCESS(CWG1STR,3)
// PIE7<CWGIE>
extern volatile __bit                   CWGIE               __at(0x7620);	// @ (0xEC4 * 8 + 0)
#define                                 CWGIE_bit           _BIT_ACCESS(PIE7,0)
// PIR7<CWGIF>
extern volatile __bit                   CWGIF               __at(0x7660);	// @ (0xECC * 8 + 0)
#define                                 CWGIF_bit           _BIT_ACCESS(PIR7,0)
// CWG1PPS<CWGINPPS0>
extern volatile __bit                   CWGINPPS0           __at(0x7560);	// @ (0xEAC * 8 + 0)
#define                                 CWGINPPS0_bit       _BIT_ACCESS(CWG1PPS,0)
// CWG1PPS<CWGINPPS1>
extern volatile __bit                   CWGINPPS1           __at(0x7561);	// @ (0xEAC * 8 + 1)
#define                                 CWGINPPS1_bit       _BIT_ACCESS(CWG1PPS,1)
// CWG1PPS<CWGINPPS2>
extern volatile __bit                   CWGINPPS2           __at(0x7562);	// @ (0xEAC * 8 + 2)
#define                                 CWGINPPS2_bit       _BIT_ACCESS(CWG1PPS,2)
// CWG1PPS<CWGINPPS3>
extern volatile __bit                   CWGINPPS3           __at(0x7563);	// @ (0xEAC * 8 + 3)
#define                                 CWGINPPS3_bit       _BIT_ACCESS(CWG1PPS,3)
// CWG1PPS<CWGINPPS4>
extern volatile __bit                   CWGINPPS4           __at(0x7564);	// @ (0xEAC * 8 + 4)
#define                                 CWGINPPS4_bit       _BIT_ACCESS(CWG1PPS,4)
// IPR7<CWGIP>
extern volatile __bit                   CWGIP               __at(0x75E0);	// @ (0xEBC * 8 + 0)
#define                                 CWGIP_bit           _BIT_ACCESS(IPR7,0)
// PMD4<CWGMD>
extern volatile __bit                   CWGMD               __at(0x7700);	// @ (0xEE0 * 8 + 0)
#define                                 CWGMD_bit           _BIT_ACCESS(PMD4,0)
// SSP1STAT<DA>
extern volatile __bit                   DA                  __at(0x7CA5);	// @ (0xF94 * 8 + 5)
#define                                 DA_bit              _BIT_ACCESS(SSP1STAT,5)
// SSP1STAT<DA1>
extern volatile __bit                   DA1                 __at(0x7CA5);	// @ (0xF94 * 8 + 5)
#define                                 DA1_bit             _BIT_ACCESS(SSP1STAT,5)
// SCANCON0<DABORT>
extern volatile __bit                   DABORT              __at(0x7A54);	// @ (0xF4A * 8 + 4)
#define                                 DABORT_bit          _BIT_ACCESS(SCANCON0,4)
// DAC1CON0<DAC1EN>
extern volatile __bit                   DAC1EN              __at(0x7977);	// @ (0xF2E * 8 + 7)
#define                                 DAC1EN_bit          _BIT_ACCESS(DAC1CON0,7)
// DAC1CON0<DAC1NSS>
extern volatile __bit                   DAC1NSS             __at(0x7970);	// @ (0xF2E * 8 + 0)
#define                                 DAC1NSS_bit         _BIT_ACCESS(DAC1CON0,0)
// DAC1CON0<DAC1OE1>
extern volatile __bit                   DAC1OE1             __at(0x7975);	// @ (0xF2E * 8 + 5)
#define                                 DAC1OE1_bit         _BIT_ACCESS(DAC1CON0,5)
// DAC1CON0<DAC1OE2>
extern volatile __bit                   DAC1OE2             __at(0x7974);	// @ (0xF2E * 8 + 4)
#define                                 DAC1OE2_bit         _BIT_ACCESS(DAC1CON0,4)
// DAC1CON0<DAC1PSS0>
extern volatile __bit                   DAC1PSS0            __at(0x7972);	// @ (0xF2E * 8 + 2)
#define                                 DAC1PSS0_bit        _BIT_ACCESS(DAC1CON0,2)
// DAC1CON0<DAC1PSS1>
extern volatile __bit                   DAC1PSS1            __at(0x7973);	// @ (0xF2E * 8 + 3)
#define                                 DAC1PSS1_bit        _BIT_ACCESS(DAC1CON0,3)
// DAC1CON1<DAC1R0>
extern volatile __bit                   DAC1R0              __at(0x7978);	// @ (0xF2F * 8 + 0)
#define                                 DAC1R0_bit          _BIT_ACCESS(DAC1CON1,0)
// DAC1CON1<DAC1R1>
extern volatile __bit                   DAC1R1              __at(0x7979);	// @ (0xF2F * 8 + 1)
#define                                 DAC1R1_bit          _BIT_ACCESS(DAC1CON1,1)
// DAC1CON1<DAC1R2>
extern volatile __bit                   DAC1R2              __at(0x797A);	// @ (0xF2F * 8 + 2)
#define                                 DAC1R2_bit          _BIT_ACCESS(DAC1CON1,2)
// DAC1CON1<DAC1R3>
extern volatile __bit                   DAC1R3              __at(0x797B);	// @ (0xF2F * 8 + 3)
#define                                 DAC1R3_bit          _BIT_ACCESS(DAC1CON1,3)
// DAC1CON1<DAC1R4>
extern volatile __bit                   DAC1R4              __at(0x797C);	// @ (0xF2F * 8 + 4)
#define                                 DAC1R4_bit          _BIT_ACCESS(DAC1CON1,4)
// PMD2<DACMD>
extern volatile __bit                   DACMD               __at(0x76F6);	// @ (0xEDE * 8 + 6)
#define                                 DACMD_bit           _BIT_ACCESS(PMD2,6)
// CRCDATL<DATA0>
extern volatile __bit                   DATA0               __at(0x7B78);	// @ (0xF6F * 8 + 0)
#define                                 DATA0_bit           _BIT_ACCESS(CRCDATL,0)
// CRCDATL<DATA1>
extern volatile __bit                   DATA1               __at(0x7B79);	// @ (0xF6F * 8 + 1)
#define                                 DATA1_bit           _BIT_ACCESS(CRCDATL,1)
// CRCDATH<DATA10>
extern volatile __bit                   DATA10              __at(0x7B82);	// @ (0xF70 * 8 + 2)
#define                                 DATA10_bit          _BIT_ACCESS(CRCDATH,2)
// CRCDATH<DATA11>
extern volatile __bit                   DATA11              __at(0x7B83);	// @ (0xF70 * 8 + 3)
#define                                 DATA11_bit          _BIT_ACCESS(CRCDATH,3)
// CRCDATH<DATA12>
extern volatile __bit                   DATA12              __at(0x7B84);	// @ (0xF70 * 8 + 4)
#define                                 DATA12_bit          _BIT_ACCESS(CRCDATH,4)
// CRCDATH<DATA13>
extern volatile __bit                   DATA13              __at(0x7B85);	// @ (0xF70 * 8 + 5)
#define                                 DATA13_bit          _BIT_ACCESS(CRCDATH,5)
// CRCDATH<DATA14>
extern volatile __bit                   DATA14              __at(0x7B86);	// @ (0xF70 * 8 + 6)
#define                                 DATA14_bit          _BIT_ACCESS(CRCDATH,6)
// CRCDATH<DATA15>
extern volatile __bit                   DATA15              __at(0x7B87);	// @ (0xF70 * 8 + 7)
#define                                 DATA15_bit          _BIT_ACCESS(CRCDATH,7)
// CRCDATL<DATA2>
extern volatile __bit                   DATA2               __at(0x7B7A);	// @ (0xF6F * 8 + 2)
#define                                 DATA2_bit           _BIT_ACCESS(CRCDATL,2)
// CRCDATL<DATA3>
extern volatile __bit                   DATA3               __at(0x7B7B);	// @ (0xF6F * 8 + 3)
#define                                 DATA3_bit           _BIT_ACCESS(CRCDATL,3)
// CRCDATL<DATA4>
extern volatile __bit                   DATA4               __at(0x7B7C);	// @ (0xF6F * 8 + 4)
#define                                 DATA4_bit           _BIT_ACCESS(CRCDATL,4)
// CRCDATL<DATA5>
extern volatile __bit                   DATA5               __at(0x7B7D);	// @ (0xF6F * 8 + 5)
#define                                 DATA5_bit           _BIT_ACCESS(CRCDATL,5)
// CRCDATL<DATA6>
extern volatile __bit                   DATA6               __at(0x7B7E);	// @ (0xF6F * 8 + 6)
#define                                 DATA6_bit           _BIT_ACCESS(CRCDATL,6)
// CRCDATL<DATA7>
extern volatile __bit                   DATA7               __at(0x7B7F);	// @ (0xF6F * 8 + 7)
#define                                 DATA7_bit           _BIT_ACCESS(CRCDATL,7)
// CRCDATH<DATA8>
extern volatile __bit                   DATA8               __at(0x7B80);	// @ (0xF70 * 8 + 0)
#define                                 DATA8_bit           _BIT_ACCESS(CRCDATH,0)
// CRCDATH<DATA9>
extern volatile __bit                   DATA9               __at(0x7B81);	// @ (0xF70 * 8 + 1)
#define                                 DATA9_bit           _BIT_ACCESS(CRCDATH,1)
// SSP1STAT<DATA_ADDRESS>
extern volatile __bit                   DATA_ADDRESS        __at(0x7CA5);	// @ (0xF94 * 8 + 5)
#define                                 DATA_ADDRESS_bit    _BIT_ACCESS(SSP1STAT,5)
// SSP1STAT<DATA_ADDRESS1>
extern volatile __bit                   DATA_ADDRESS1       __at(0x7CA5);	// @ (0xF94 * 8 + 5)
#define                                 DATA_ADDRESS1_bit   _BIT_ACCESS(SSP1STAT,5)
// CWG1DBF<DBF0>
extern volatile __bit                   DBF0                __at(0x79F0);	// @ (0xF3E * 8 + 0)
#define                                 DBF0_bit            _BIT_ACCESS(CWG1DBF,0)
// CWG1DBF<DBF1>
extern volatile __bit                   DBF1                __at(0x79F1);	// @ (0xF3E * 8 + 1)
#define                                 DBF1_bit            _BIT_ACCESS(CWG1DBF,1)
// CWG1DBF<DBF2>
extern volatile __bit                   DBF2                __at(0x79F2);	// @ (0xF3E * 8 + 2)
#define                                 DBF2_bit            _BIT_ACCESS(CWG1DBF,2)
// CWG1DBF<DBF3>
extern volatile __bit                   DBF3                __at(0x79F3);	// @ (0xF3E * 8 + 3)
#define                                 DBF3_bit            _BIT_ACCESS(CWG1DBF,3)
// CWG1DBF<DBF4>
extern volatile __bit                   DBF4                __at(0x79F4);	// @ (0xF3E * 8 + 4)
#define                                 DBF4_bit            _BIT_ACCESS(CWG1DBF,4)
// CWG1DBF<DBF5>
extern volatile __bit                   DBF5                __at(0x79F5);	// @ (0xF3E * 8 + 5)
#define                                 DBF5_bit            _BIT_ACCESS(CWG1DBF,5)
// CWG1DBR<DBR0>
extern volatile __bit                   DBR0                __at(0x79E8);	// @ (0xF3D * 8 + 0)
#define                                 DBR0_bit            _BIT_ACCESS(CWG1DBR,0)
// CWG1DBR<DBR1>
extern volatile __bit                   DBR1                __at(0x79E9);	// @ (0xF3D * 8 + 1)
#define                                 DBR1_bit            _BIT_ACCESS(CWG1DBR,1)
// CWG1DBR<DBR2>
extern volatile __bit                   DBR2                __at(0x79EA);	// @ (0xF3D * 8 + 2)
#define                                 DBR2_bit            _BIT_ACCESS(CWG1DBR,2)
// CWG1DBR<DBR3>
extern volatile __bit                   DBR3                __at(0x79EB);	// @ (0xF3D * 8 + 3)
#define                                 DBR3_bit            _BIT_ACCESS(CWG1DBR,3)
// CWG1DBR<DBR4>
extern volatile __bit                   DBR4                __at(0x79EC);	// @ (0xF3D * 8 + 4)
#define                                 DBR4_bit            _BIT_ACCESS(CWG1DBR,4)
// CWG1DBR<DBR5>
extern volatile __bit                   DBR5                __at(0x79ED);	// @ (0xF3D * 8 + 5)
#define                                 DBR5_bit            _BIT_ACCESS(CWG1DBR,5)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x7EC1);	// @ (0xFD8 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// SSP1CON3<DHEN>
extern volatile __bit                   DHEN                __at(0x7CB8);	// @ (0xF97 * 8 + 0)
#define                                 DHEN_bit            _BIT_ACCESS(SSP1CON3,0)
// CLKRCON<DIV0>
extern volatile __bit                   DIV0                __at(0x79C8);	// @ (0xF39 * 8 + 0)
#define                                 DIV0_bit            _BIT_ACCESS(CLKRCON,0)
// CLKRCON<DIV1>
extern volatile __bit                   DIV1                __at(0x79C9);	// @ (0xF39 * 8 + 1)
#define                                 DIV1_bit            _BIT_ACCESS(CLKRCON,1)
// CLKRCON<DIV2>
extern volatile __bit                   DIV2                __at(0x79CA);	// @ (0xF39 * 8 + 2)
#define                                 DIV2_bit            _BIT_ACCESS(CLKRCON,2)
// CRCCON1<DLEN0>
extern volatile __bit                   DLEN0               __at(0x7BC4);	// @ (0xF78 * 8 + 4)
#define                                 DLEN0_bit           _BIT_ACCESS(CRCCON1,4)
// CRCCON1<DLEN1>
extern volatile __bit                   DLEN1               __at(0x7BC5);	// @ (0xF78 * 8 + 5)
#define                                 DLEN1_bit           _BIT_ACCESS(CRCCON1,5)
// CRCCON1<DLEN2>
extern volatile __bit                   DLEN2               __at(0x7BC6);	// @ (0xF78 * 8 + 6)
#define                                 DLEN2_bit           _BIT_ACCESS(CRCCON1,6)
// CRCCON1<DLEN3>
extern volatile __bit                   DLEN3               __at(0x7BC7);	// @ (0xF78 * 8 + 7)
#define                                 DLEN3_bit           _BIT_ACCESS(CRCCON1,7)
// CPUDOZE<DOE>
extern volatile __bit                   DOE                 __at(0x7694);	// @ (0xED2 * 8 + 4)
#define                                 DOE_bit             _BIT_ACCESS(CPUDOZE,4)
// ADCON0<DONE>
extern volatile __bit                   DONE                __at(0x7AD8);	// @ (0xF5B * 8 + 0)
#define                                 DONE_bit            _BIT_ACCESS(ADCON0,0)
// CPUDOZE<DOZE0>
extern volatile __bit                   DOZE0               __at(0x7690);	// @ (0xED2 * 8 + 0)
#define                                 DOZE0_bit           _BIT_ACCESS(CPUDOZE,0)
// CPUDOZE<DOZE1>
extern volatile __bit                   DOZE1               __at(0x7691);	// @ (0xED2 * 8 + 1)
#define                                 DOZE1_bit           _BIT_ACCESS(CPUDOZE,1)
// CPUDOZE<DOZE2>
extern volatile __bit                   DOZE2               __at(0x7692);	// @ (0xED2 * 8 + 2)
#define                                 DOZE2_bit           _BIT_ACCESS(CPUDOZE,2)
// CPUDOZE<DOZEN>
extern volatile __bit                   DOZEN               __at(0x7696);	// @ (0xED2 * 8 + 6)
#define                                 DOZEN_bit           _BIT_ACCESS(CPUDOZE,6)
// PMD5<DSMMD>
extern volatile __bit                   DSMMD               __at(0x7708);	// @ (0xEE1 * 8 + 0)
#define                                 DSMMD_bit           _BIT_ACCESS(PMD5,0)
// SSP1STAT<D_A>
extern volatile __bit                   D_A                 __at(0x7CA5);	// @ (0xF94 * 8 + 5)
#define                                 D_A_bit             _BIT_ACCESS(SSP1STAT,5)
// SSP1STAT<D_A1>
extern volatile __bit                   D_A1                __at(0x7CA5);	// @ (0xF94 * 8 + 5)
#define                                 D_A1_bit            _BIT_ACCESS(SSP1STAT,5)
// SSP1STAT<D_NOT_A>
extern volatile __bit                   D_NOT_A             __at(0x7CA5);	// @ (0xF94 * 8 + 5)
#define                                 D_NOT_A_bit         _BIT_ACCESS(SSP1STAT,5)
// SSP1STAT<D_NOT_A1>
extern volatile __bit                   D_NOT_A1            __at(0x7CA5);	// @ (0xF94 * 8 + 5)
