GopalSaraf/Practicals/PSDL/include/proc/pic18f25q10.h
#define                                 D_NOT_A1_bit        _BIT_ACCESS(SSP1STAT,5)
// SSP1STAT<D_nA>
extern volatile __bit                   D_nA                __at(0x7CA5);	// @ (0xF94 * 8 + 5)
#define                                 D_nA_bit            _BIT_ACCESS(SSP1STAT,5)
// SSP1STAT<D_nA1>
extern volatile __bit                   D_nA1               __at(0x7CA5);	// @ (0xF94 * 8 + 5)
#define                                 D_nA1_bit           _BIT_ACCESS(SSP1STAT,5)
// PMD1<EMBMD>
extern volatile __bit                   EMBMD               __at(0x76E8);	// @ (0xEDD * 8 + 0)
#define                                 EMBMD_bit           _BIT_ACCESS(PMD1,0)
// OSCEN<EXTOEN>
extern volatile __bit                   EXTOEN              __at(0x76BF);	// @ (0xED7 * 8 + 7)
#define                                 EXTOEN_bit          _BIT_ACCESS(OSCEN,7)
// OSCSTAT<EXTOR>
extern volatile __bit                   EXTOR               __at(0x76B7);	// @ (0xED6 * 8 + 7)
#define                                 EXTOR_bit           _BIT_ACCESS(OSCSTAT,7)
// RC1STA<FERR>
extern volatile __bit                   FERR                __at(0x7CE2);	// @ (0xF9C * 8 + 2)
#define                                 FERR_bit            _BIT_ACCESS(RC1STA,2)
// OSCFRQ<FRQ0>
extern volatile __bit                   FRQ0                __at(0x76C8);	// @ (0xED9 * 8 + 0)
#define                                 FRQ0_bit            _BIT_ACCESS(OSCFRQ,0)
// OSCFRQ<FRQ1>
extern volatile __bit                   FRQ1                __at(0x76C9);	// @ (0xED9 * 8 + 1)
#define                                 FRQ1_bit            _BIT_ACCESS(OSCFRQ,1)
// OSCFRQ<FRQ2>
extern volatile __bit                   FRQ2                __at(0x76CA);	// @ (0xED9 * 8 + 2)
#define                                 FRQ2_bit            _BIT_ACCESS(OSCFRQ,2)
// OSCFRQ<FRQ3>
extern volatile __bit                   FRQ3                __at(0x76CB);	// @ (0xED9 * 8 + 3)
#define                                 FRQ3_bit            _BIT_ACCESS(OSCFRQ,3)
// CRCCON0<FULL>
extern volatile __bit                   FULL                __at(0x7BB8);	// @ (0xF77 * 8 + 0)
#define                                 FULL_bit            _BIT_ACCESS(CRCCON0,0)
// FVRCON<FVREN>
extern volatile __bit                   FVREN               __at(0x7967);	// @ (0xF2C * 8 + 7)
#define                                 FVREN_bit           _BIT_ACCESS(FVRCON,7)
// PMD0<FVRMD>
extern volatile __bit                   FVRMD               __at(0x76E6);	// @ (0xEDC * 8 + 6)
#define                                 FVRMD_bit           _BIT_ACCESS(PMD0,6)
// FVRCON<FVRRDY>
extern volatile __bit                   FVRRDY              __at(0x7966);	// @ (0xF2C * 8 + 6)
#define                                 FVRRDY_bit          _BIT_ACCESS(FVRCON,6)
// CWG1CON0<G1EN>
extern volatile __bit                   G1EN                __at(0x79FF);	// @ (0xF3F * 8 + 7)
#define                                 G1EN_bit            _BIT_ACCESS(CWG1CON0,7)
// SSP1CON2<GCEN>
extern volatile __bit                   GCEN                __at(0x7CB7);	// @ (0xF96 * 8 + 7)
#define                                 GCEN_bit            _BIT_ACCESS(SSP1CON2,7)
// SSP1CON2<GCEN1>
extern volatile __bit                   GCEN1               __at(0x7CB7);	// @ (0xF96 * 8 + 7)
#define                                 GCEN1_bit           _BIT_ACCESS(SSP1CON2,7)
// INTCON<GIE>
extern volatile __bit                   GIE                 __at(0x7F97);	// @ (0xFF2 * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON,7)
// INTCON<GIEH>
extern volatile __bit                   GIEH                __at(0x7F97);	// @ (0xFF2 * 8 + 7)
#define                                 GIEH_bit            _BIT_ACCESS(INTCON,7)
// INTCON<GIEL>
extern volatile __bit                   GIEL                __at(0x7F96);	// @ (0xFF2 * 8 + 6)
#define                                 GIEL_bit            _BIT_ACCESS(INTCON,6)
// INTCON<GIE_GIEH>
extern volatile __bit                   GIE_GIEH            __at(0x7F97);	// @ (0xFF2 * 8 + 7)
#define                                 GIE_GIEH_bit        _BIT_ACCESS(INTCON,7)
// ADCON0<GODONE>
extern volatile __bit                   GODONE              __at(0x7ADA);	// @ (0xF5B * 8 + 2)
#define                                 GODONE_bit          _BIT_ACCESS(ADCON0,2)
// ADCON0<GO_NOT_DONE>
extern volatile __bit                   GO_NOT_DONE         __at(0x7AD8);	// @ (0xF5B * 8 + 0)
#define                                 GO_NOT_DONE_bit     _BIT_ACCESS(ADCON0,0)
// ADCON0<GO_nDONE>
extern volatile __bit                   GO_nDONE            __at(0x7AD8);	// @ (0xF5B * 8 + 0)
#define                                 GO_nDONE_bit        _BIT_ACCESS(ADCON0,0)
// SCANHADRL<HADR0>
extern volatile __bit                   HADR0               __at(0x7A38);	// @ (0xF47 * 8 + 0)
#define                                 HADR0_bit           _BIT_ACCESS(SCANHADRL,0)
// SCANHADRL<HADR1>
extern volatile __bit                   HADR1               __at(0x7A39);	// @ (0xF47 * 8 + 1)
#define                                 HADR1_bit           _BIT_ACCESS(SCANHADRL,1)
// SCANHADRH<HADR10>
extern volatile __bit                   HADR10              __at(0x7A42);	// @ (0xF48 * 8 + 2)
#define                                 HADR10_bit          _BIT_ACCESS(SCANHADRH,2)
// SCANHADRH<HADR11>
extern volatile __bit                   HADR11              __at(0x7A43);	// @ (0xF48 * 8 + 3)
#define                                 HADR11_bit          _BIT_ACCESS(SCANHADRH,3)
// SCANHADRH<HADR12>
extern volatile __bit                   HADR12              __at(0x7A44);	// @ (0xF48 * 8 + 4)
#define                                 HADR12_bit          _BIT_ACCESS(SCANHADRH,4)
// SCANHADRH<HADR13>
extern volatile __bit                   HADR13              __at(0x7A45);	// @ (0xF48 * 8 + 5)
#define                                 HADR13_bit          _BIT_ACCESS(SCANHADRH,5)
// SCANHADRH<HADR14>
extern volatile __bit                   HADR14              __at(0x7A46);	// @ (0xF48 * 8 + 6)
#define                                 HADR14_bit          _BIT_ACCESS(SCANHADRH,6)
// SCANHADRH<HADR15>
extern volatile __bit                   HADR15              __at(0x7A47);	// @ (0xF48 * 8 + 7)
#define                                 HADR15_bit          _BIT_ACCESS(SCANHADRH,7)
// SCANHADRU<HADR16>
extern volatile __bit                   HADR16              __at(0x7A48);	// @ (0xF49 * 8 + 0)
#define                                 HADR16_bit          _BIT_ACCESS(SCANHADRU,0)
// SCANHADRU<HADR17>
extern volatile __bit                   HADR17              __at(0x7A49);	// @ (0xF49 * 8 + 1)
#define                                 HADR17_bit          _BIT_ACCESS(SCANHADRU,1)
// SCANHADRU<HADR18>
extern volatile __bit                   HADR18              __at(0x7A4A);	// @ (0xF49 * 8 + 2)
#define                                 HADR18_bit          _BIT_ACCESS(SCANHADRU,2)
// SCANHADRU<HADR19>
extern volatile __bit                   HADR19              __at(0x7A4B);	// @ (0xF49 * 8 + 3)
#define                                 HADR19_bit          _BIT_ACCESS(SCANHADRU,3)
// SCANHADRL<HADR2>
extern volatile __bit                   HADR2               __at(0x7A3A);	// @ (0xF47 * 8 + 2)
#define                                 HADR2_bit           _BIT_ACCESS(SCANHADRL,2)
// SCANHADRU<HADR20>
extern volatile __bit                   HADR20              __at(0x7A4C);	// @ (0xF49 * 8 + 4)
#define                                 HADR20_bit          _BIT_ACCESS(SCANHADRU,4)
// SCANHADRU<HADR21>
extern volatile __bit                   HADR21              __at(0x7A4D);	// @ (0xF49 * 8 + 5)
#define                                 HADR21_bit          _BIT_ACCESS(SCANHADRU,5)
// SCANHADRL<HADR3>
extern volatile __bit                   HADR3               __at(0x7A3B);	// @ (0xF47 * 8 + 3)
#define                                 HADR3_bit           _BIT_ACCESS(SCANHADRL,3)
// SCANHADRL<HADR4>
extern volatile __bit                   HADR4               __at(0x7A3C);	// @ (0xF47 * 8 + 4)
#define                                 HADR4_bit           _BIT_ACCESS(SCANHADRL,4)
// SCANHADRL<HADR5>
extern volatile __bit                   HADR5               __at(0x7A3D);	// @ (0xF47 * 8 + 5)
#define                                 HADR5_bit           _BIT_ACCESS(SCANHADRL,5)
// SCANHADRL<HADR6>
extern volatile __bit                   HADR6               __at(0x7A3E);	// @ (0xF47 * 8 + 6)
#define                                 HADR6_bit           _BIT_ACCESS(SCANHADRL,6)
// SCANHADRL<HADR7>
extern volatile __bit                   HADR7               __at(0x7A3F);	// @ (0xF47 * 8 + 7)
#define                                 HADR7_bit           _BIT_ACCESS(SCANHADRL,7)
// SCANHADRH<HADR8>
extern volatile __bit                   HADR8               __at(0x7A40);	// @ (0xF48 * 8 + 0)
#define                                 HADR8_bit           _BIT_ACCESS(SCANHADRH,0)
// SCANHADRH<HADR9>
extern volatile __bit                   HADR9               __at(0x7A41);	// @ (0xF48 * 8 + 1)
#define                                 HADR9_bit           _BIT_ACCESS(SCANHADRH,1)
// OSCEN<HFOEN>
extern volatile __bit                   HFOEN               __at(0x76BE);	// @ (0xED7 * 8 + 6)
#define                                 HFOEN_bit           _BIT_ACCESS(OSCEN,6)
// OSCSTAT<HFOR>
extern volatile __bit                   HFOR                __at(0x76B6);	// @ (0xED6 * 8 + 6)
#define                                 HFOR_bit            _BIT_ACCESS(OSCSTAT,6)
// HLVDCON0<HLVDEN>
extern volatile __bit                   HLVDEN              __at(0x7957);	// @ (0xF2A * 8 + 7)
#define                                 HLVDEN_bit          _BIT_ACCESS(HLVDCON0,7)
// PIE2<HLVDIE>
extern volatile __bit                   HLVDIE              __at(0x75FF);	// @ (0xEBF * 8 + 7)
#define                                 HLVDIE_bit          _BIT_ACCESS(PIE2,7)
// PIR2<HLVDIF>
extern volatile __bit                   HLVDIF              __at(0x763F);	// @ (0xEC7 * 8 + 7)
#define                                 HLVDIF_bit          _BIT_ACCESS(PIR2,7)
// HLVDCON0<HLVDINTH>
extern volatile __bit                   HLVDINTH            __at(0x7951);	// @ (0xF2A * 8 + 1)
#define                                 HLVDINTH_bit        _BIT_ACCESS(HLVDCON0,1)
// HLVDCON0<HLVDINTL>
extern volatile __bit                   HLVDINTL            __at(0x7950);	// @ (0xF2A * 8 + 0)
#define                                 HLVDINTL_bit        _BIT_ACCESS(HLVDCON0,0)
// IPR2<HLVDIP>
extern volatile __bit                   HLVDIP              __at(0x75BF);	// @ (0xEB7 * 8 + 7)
#define                                 HLVDIP_bit          _BIT_ACCESS(IPR2,7)
// PMD0<HLVDMD>
extern volatile __bit                   HLVDMD              __at(0x76E5);	// @ (0xEDC * 8 + 5)
#define                                 HLVDMD_bit          _BIT_ACCESS(PMD0,5)
// HLVDCON0<HLVDOUT>
extern volatile __bit                   HLVDOUT             __at(0x7955);	// @ (0xF2A * 8 + 5)
#define                                 HLVDOUT_bit         _BIT_ACCESS(HLVDCON0,5)
// HLVDCON0<HLVDRDY>
extern volatile __bit                   HLVDRDY             __at(0x7954);	// @ (0xF2A * 8 + 4)
#define                                 HLVDRDY_bit         _BIT_ACCESS(HLVDCON0,4)
// HLVDCON1<HLVDSEL0>
extern volatile __bit                   HLVDSEL0            __at(0x7958);	// @ (0xF2B * 8 + 0)
#define                                 HLVDSEL0_bit        _BIT_ACCESS(HLVDCON1,0)
// HLVDCON1<HLVDSEL1>
extern volatile __bit                   HLVDSEL1            __at(0x7959);	// @ (0xF2B * 8 + 1)
#define                                 HLVDSEL1_bit        _BIT_ACCESS(HLVDCON1,1)
// HLVDCON1<HLVDSEL2>
extern volatile __bit                   HLVDSEL2            __at(0x795A);	// @ (0xF2B * 8 + 2)
#define                                 HLVDSEL2_bit        _BIT_ACCESS(HLVDCON1,2)
// HLVDCON1<HLVDSEL3>
extern volatile __bit                   HLVDSEL3            __at(0x795B);	// @ (0xF2B * 8 + 3)
#define                                 HLVDSEL3_bit        _BIT_ACCESS(HLVDCON1,3)
// SSP1STAT<I2C_DAT>
extern volatile __bit                   I2C_DAT             __at(0x7CA5);	// @ (0xF94 * 8 + 5)
#define                                 I2C_DAT_bit         _BIT_ACCESS(SSP1STAT,5)
// SSP1STAT<I2C_DAT1>
extern volatile __bit                   I2C_DAT1            __at(0x7CA5);	// @ (0xF94 * 8 + 5)
#define                                 I2C_DAT1_bit        _BIT_ACCESS(SSP1STAT,5)
// SSP1STAT<I2C_READ>
extern volatile __bit                   I2C_READ            __at(0x7CA2);	// @ (0xF94 * 8 + 2)
#define                                 I2C_READ_bit        _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<I2C_READ1>
extern volatile __bit                   I2C_READ1           __at(0x7CA2);	// @ (0xF94 * 8 + 2)
#define                                 I2C_READ1_bit       _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<I2C_START>
extern volatile __bit                   I2C_START           __at(0x7CA3);	// @ (0xF94 * 8 + 3)
#define                                 I2C_START_bit       _BIT_ACCESS(SSP1STAT,3)
// SSP1STAT<I2C_START1>
extern volatile __bit                   I2C_START1          __at(0x7CA3);	// @ (0xF94 * 8 + 3)
#define                                 I2C_START1_bit      _BIT_ACCESS(SSP1STAT,3)
// SSP1STAT<I2C_STOP>
extern volatile __bit                   I2C_STOP            __at(0x7CA4);	// @ (0xF94 * 8 + 4)
#define                                 I2C_STOP_bit        _BIT_ACCESS(SSP1STAT,4)
// SSP1STAT<I2C_STOP2>
extern volatile __bit                   I2C_STOP2           __at(0x7CA4);	// @ (0xF94 * 8 + 4)
#define                                 I2C_STOP2_bit       _BIT_ACCESS(SSP1STAT,4)
// CPUDOZE<IDLEN>
extern volatile __bit                   IDLEN               __at(0x7697);	// @ (0xED2 * 8 + 7)
#define                                 IDLEN_bit           _BIT_ACCESS(CPUDOZE,7)
// CWG1CON1<IN>
extern volatile __bit                   IN                  __at(0x7A05);	// @ (0xF40 * 8 + 5)
#define                                 IN_bit              _BIT_ACCESS(CWG1CON1,5)
// INLVLA<INLVLA0>
extern volatile __bit                   INLVLA0             __at(0x7840);	// @ (0xF08 * 8 + 0)
#define                                 INLVLA0_bit         _BIT_ACCESS(INLVLA,0)
// INLVLA<INLVLA1>
extern volatile __bit                   INLVLA1             __at(0x7841);	// @ (0xF08 * 8 + 1)
#define                                 INLVLA1_bit         _BIT_ACCESS(INLVLA,1)
// INLVLA<INLVLA2>
extern volatile __bit                   INLVLA2             __at(0x7842);	// @ (0xF08 * 8 + 2)
#define                                 INLVLA2_bit         _BIT_ACCESS(INLVLA,2)
// INLVLA<INLVLA3>
extern volatile __bit                   INLVLA3             __at(0x7843);	// @ (0xF08 * 8 + 3)
#define                                 INLVLA3_bit         _BIT_ACCESS(INLVLA,3)
// INLVLA<INLVLA4>
extern volatile __bit                   INLVLA4             __at(0x7844);	// @ (0xF08 * 8 + 4)
#define                                 INLVLA4_bit         _BIT_ACCESS(INLVLA,4)
// INLVLA<INLVLA5>
extern volatile __bit                   INLVLA5             __at(0x7845);	// @ (0xF08 * 8 + 5)
#define                                 INLVLA5_bit         _BIT_ACCESS(INLVLA,5)
// INLVLA<INLVLA6>
extern volatile __bit                   INLVLA6             __at(0x7846);	// @ (0xF08 * 8 + 6)
#define                                 INLVLA6_bit         _BIT_ACCESS(INLVLA,6)
// INLVLA<INLVLA7>
extern volatile __bit                   INLVLA7             __at(0x7847);	// @ (0xF08 * 8 + 7)
#define                                 INLVLA7_bit         _BIT_ACCESS(INLVLA,7)
// INLVLB<INLVLB0>
extern volatile __bit                   INLVLB0             __at(0x7880);	// @ (0xF10 * 8 + 0)
#define                                 INLVLB0_bit         _BIT_ACCESS(INLVLB,0)
// INLVLB<INLVLB1>
extern volatile __bit                   INLVLB1             __at(0x7881);	// @ (0xF10 * 8 + 1)
#define                                 INLVLB1_bit         _BIT_ACCESS(INLVLB,1)
// INLVLB<INLVLB2>
extern volatile __bit                   INLVLB2             __at(0x7882);	// @ (0xF10 * 8 + 2)
#define                                 INLVLB2_bit         _BIT_ACCESS(INLVLB,2)
// INLVLB<INLVLB3>
extern volatile __bit                   INLVLB3             __at(0x7883);	// @ (0xF10 * 8 + 3)
#define                                 INLVLB3_bit         _BIT_ACCESS(INLVLB,3)
// INLVLB<INLVLB4>
extern volatile __bit                   INLVLB4             __at(0x7884);	// @ (0xF10 * 8 + 4)
#define                                 INLVLB4_bit         _BIT_ACCESS(INLVLB,4)
// INLVLB<INLVLB5>
extern volatile __bit                   INLVLB5             __at(0x7885);	// @ (0xF10 * 8 + 5)
#define                                 INLVLB5_bit         _BIT_ACCESS(INLVLB,5)
// INLVLB<INLVLB6>
extern volatile __bit                   INLVLB6             __at(0x7886);	// @ (0xF10 * 8 + 6)
#define                                 INLVLB6_bit         _BIT_ACCESS(INLVLB,6)
// INLVLB<INLVLB7>
extern volatile __bit                   INLVLB7             __at(0x7887);	// @ (0xF10 * 8 + 7)
#define                                 INLVLB7_bit         _BIT_ACCESS(INLVLB,7)
// INLVLC<INLVLC0>
extern volatile __bit                   INLVLC0             __at(0x78C0);	// @ (0xF18 * 8 + 0)
#define                                 INLVLC0_bit         _BIT_ACCESS(INLVLC,0)
// INLVLC<INLVLC1>
extern volatile __bit                   INLVLC1             __at(0x78C1);	// @ (0xF18 * 8 + 1)
#define                                 INLVLC1_bit         _BIT_ACCESS(INLVLC,1)
// INLVLC<INLVLC2>
extern volatile __bit                   INLVLC2             __at(0x78C2);	// @ (0xF18 * 8 + 2)
#define                                 INLVLC2_bit         _BIT_ACCESS(INLVLC,2)
// INLVLC<INLVLC3>
extern volatile __bit                   INLVLC3             __at(0x78C3);	// @ (0xF18 * 8 + 3)
#define                                 INLVLC3_bit         _BIT_ACCESS(INLVLC,3)
// INLVLC<INLVLC4>
extern volatile __bit                   INLVLC4             __at(0x78C4);	// @ (0xF18 * 8 + 4)
#define                                 INLVLC4_bit         _BIT_ACCESS(INLVLC,4)
// INLVLC<INLVLC5>
extern volatile __bit                   INLVLC5             __at(0x78C5);	// @ (0xF18 * 8 + 5)
#define                                 INLVLC5_bit         _BIT_ACCESS(INLVLC,5)
// INLVLC<INLVLC6>
extern volatile __bit                   INLVLC6             __at(0x78C6);	// @ (0xF18 * 8 + 6)
#define                                 INLVLC6_bit         _BIT_ACCESS(INLVLC,6)
// INLVLC<INLVLC7>
extern volatile __bit                   INLVLC7             __at(0x78C7);	// @ (0xF18 * 8 + 7)
#define                                 INLVLC7_bit         _BIT_ACCESS(INLVLC,7)
// INLVLE<INLVLE3>
extern volatile __bit                   INLVLE3             __at(0x792B);	// @ (0xF25 * 8 + 3)
#define                                 INLVLE3_bit         _BIT_ACCESS(INLVLE,3)
// INTCON<INT0EDG>
extern volatile __bit                   INT0EDG             __at(0x7F90);	// @ (0xFF2 * 8 + 0)
#define                                 INT0EDG_bit         _BIT_ACCESS(INTCON,0)
// PIE0<INT0IE>
extern volatile __bit                   INT0IE              __at(0x75E8);	// @ (0xEBD * 8 + 0)
#define                                 INT0IE_bit          _BIT_ACCESS(PIE0,0)
// PIR0<INT0IF>
extern volatile __bit                   INT0IF              __at(0x7628);	// @ (0xEC5 * 8 + 0)
#define                                 INT0IF_bit          _BIT_ACCESS(PIR0,0)
// IPR0<INT0IP>
extern volatile __bit                   INT0IP              __at(0x75A8);	// @ (0xEB5 * 8 + 0)
#define                                 INT0IP_bit          _BIT_ACCESS(IPR0,0)
// INT0PPS<INT0PPS0>
extern volatile __bit                   INT0PPS0            __at(0x74E0);	// @ (0xE9C * 8 + 0)
#define                                 INT0PPS0_bit        _BIT_ACCESS(INT0PPS,0)
// INT0PPS<INT0PPS1>
extern volatile __bit                   INT0PPS1            __at(0x74E1);	// @ (0xE9C * 8 + 1)
#define                                 INT0PPS1_bit        _BIT_ACCESS(INT0PPS,1)
// INT0PPS<INT0PPS2>
extern volatile __bit                   INT0PPS2            __at(0x74E2);	// @ (0xE9C * 8 + 2)
#define                                 INT0PPS2_bit        _BIT_ACCESS(INT0PPS,2)
// INT0PPS<INT0PPS3>
extern volatile __bit                   INT0PPS3            __at(0x74E3);	// @ (0xE9C * 8 + 3)
#define                                 INT0PPS3_bit        _BIT_ACCESS(INT0PPS,3)
// INTCON<INT1EDG>
extern volatile __bit                   INT1EDG             __at(0x7F91);	// @ (0xFF2 * 8 + 1)
#define                                 INT1EDG_bit         _BIT_ACCESS(INTCON,1)
// PIE0<INT1IE>
extern volatile __bit                   INT1IE              __at(0x75E9);	// @ (0xEBD * 8 + 1)
#define                                 INT1IE_bit          _BIT_ACCESS(PIE0,1)
// PIR0<INT1IF>
extern volatile __bit                   INT1IF              __at(0x7629);	// @ (0xEC5 * 8 + 1)
#define                                 INT1IF_bit          _BIT_ACCESS(PIR0,1)
// IPR0<INT1IP>
extern volatile __bit                   INT1IP              __at(0x75A9);	// @ (0xEB5 * 8 + 1)
#define                                 INT1IP_bit          _BIT_ACCESS(IPR0,1)
// INT1PPS<INT1PPS0>
extern volatile __bit                   INT1PPS0            __at(0x74E8);	// @ (0xE9D * 8 + 0)
#define                                 INT1PPS0_bit        _BIT_ACCESS(INT1PPS,0)
// INT1PPS<INT1PPS1>
extern volatile __bit                   INT1PPS1            __at(0x74E9);	// @ (0xE9D * 8 + 1)
#define                                 INT1PPS1_bit        _BIT_ACCESS(INT1PPS,1)
// INT1PPS<INT1PPS2>
extern volatile __bit                   INT1PPS2            __at(0x74EA);	// @ (0xE9D * 8 + 2)
#define                                 INT1PPS2_bit        _BIT_ACCESS(INT1PPS,2)
// INT1PPS<INT1PPS3>
extern volatile __bit                   INT1PPS3            __at(0x74EB);	// @ (0xE9D * 8 + 3)
#define                                 INT1PPS3_bit        _BIT_ACCESS(INT1PPS,3)
// INTCON<INT2EDG>
extern volatile __bit                   INT2EDG             __at(0x7F92);	// @ (0xFF2 * 8 + 2)
#define                                 INT2EDG_bit         _BIT_ACCESS(INTCON,2)
// PIE0<INT2IE>
extern volatile __bit                   INT2IE              __at(0x75EA);	// @ (0xEBD * 8 + 2)
#define                                 INT2IE_bit          _BIT_ACCESS(PIE0,2)
// PIR0<INT2IF>
extern volatile __bit                   INT2IF              __at(0x762A);	// @ (0xEC5 * 8 + 2)
#define                                 INT2IF_bit          _BIT_ACCESS(PIR0,2)
// IPR0<INT2IP>
extern volatile __bit                   INT2IP              __at(0x75AA);	// @ (0xEB5 * 8 + 2)
#define                                 INT2IP_bit          _BIT_ACCESS(IPR0,2)
// INT2PPS<INT2PPS0>
extern volatile __bit                   INT2PPS0            __at(0x74F0);	// @ (0xE9E * 8 + 0)
#define                                 INT2PPS0_bit        _BIT_ACCESS(INT2PPS,0)
// INT2PPS<INT2PPS1>
extern volatile __bit                   INT2PPS1            __at(0x74F1);	// @ (0xE9E * 8 + 1)
#define                                 INT2PPS1_bit        _BIT_ACCESS(INT2PPS,1)
// INT2PPS<INT2PPS2>
extern volatile __bit                   INT2PPS2            __at(0x74F2);	// @ (0xE9E * 8 + 2)
#define                                 INT2PPS2_bit        _BIT_ACCESS(INT2PPS,2)
// INT2PPS<INT2PPS3>
extern volatile __bit                   INT2PPS3            __at(0x74F3);	// @ (0xE9E * 8 + 3)
#define                                 INT2PPS3_bit        _BIT_ACCESS(INT2PPS,3)
// HLVDCON0<INTH>
extern volatile __bit                   INTH                __at(0x7951);	// @ (0xF2A * 8 + 1)
#define                                 INTH_bit            _BIT_ACCESS(HLVDCON0,1)
// HLVDCON0<INTL>
