GopalSaraf/Practicals/PSDL/include/proc/pic18f25q10.h
extern volatile __bit                   SSP1CLKPPS3         __at(0x7593);	// @ (0xEB2 * 8 + 3)
#define                                 SSP1CLKPPS3_bit     _BIT_ACCESS(SSP1CLKPPS,3)
// SSP1CLKPPS<SSP1CLKPPS4>
extern volatile __bit                   SSP1CLKPPS4         __at(0x7594);	// @ (0xEB2 * 8 + 4)
#define                                 SSP1CLKPPS4_bit     _BIT_ACCESS(SSP1CLKPPS,4)
// SSP1DATPPS<SSP1DATPPS0>
extern volatile __bit                   SSP1DATPPS0         __at(0x7598);	// @ (0xEB3 * 8 + 0)
#define                                 SSP1DATPPS0_bit     _BIT_ACCESS(SSP1DATPPS,0)
// SSP1DATPPS<SSP1DATPPS1>
extern volatile __bit                   SSP1DATPPS1         __at(0x7599);	// @ (0xEB3 * 8 + 1)
#define                                 SSP1DATPPS1_bit     _BIT_ACCESS(SSP1DATPPS,1)
// SSP1DATPPS<SSP1DATPPS2>
extern volatile __bit                   SSP1DATPPS2         __at(0x759A);	// @ (0xEB3 * 8 + 2)
#define                                 SSP1DATPPS2_bit     _BIT_ACCESS(SSP1DATPPS,2)
// SSP1DATPPS<SSP1DATPPS3>
extern volatile __bit                   SSP1DATPPS3         __at(0x759B);	// @ (0xEB3 * 8 + 3)
#define                                 SSP1DATPPS3_bit     _BIT_ACCESS(SSP1DATPPS,3)
// SSP1DATPPS<SSP1DATPPS4>
extern volatile __bit                   SSP1DATPPS4         __at(0x759C);	// @ (0xEB3 * 8 + 4)
#define                                 SSP1DATPPS4_bit     _BIT_ACCESS(SSP1DATPPS,4)
// PIE3<SSP1IE>
extern volatile __bit                   SSP1IE              __at(0x7600);	// @ (0xEC0 * 8 + 0)
#define                                 SSP1IE_bit          _BIT_ACCESS(PIE3,0)
// PIR3<SSP1IF>
extern volatile __bit                   SSP1IF              __at(0x7640);	// @ (0xEC8 * 8 + 0)
#define                                 SSP1IF_bit          _BIT_ACCESS(PIR3,0)
// IPR3<SSP1IP>
extern volatile __bit                   SSP1IP              __at(0x75C0);	// @ (0xEB8 * 8 + 0)
#define                                 SSP1IP_bit          _BIT_ACCESS(IPR3,0)
// SSP1SSPPS<SSP1SSPPS0>
extern volatile __bit                   SSP1SSPPS0          __at(0x75A0);	// @ (0xEB4 * 8 + 0)
#define                                 SSP1SSPPS0_bit      _BIT_ACCESS(SSP1SSPPS,0)
// SSP1SSPPS<SSP1SSPPS1>
extern volatile __bit                   SSP1SSPPS1          __at(0x75A1);	// @ (0xEB4 * 8 + 1)
#define                                 SSP1SSPPS1_bit      _BIT_ACCESS(SSP1SSPPS,1)
// SSP1SSPPS<SSP1SSPPS2>
extern volatile __bit                   SSP1SSPPS2          __at(0x75A2);	// @ (0xEB4 * 8 + 2)
#define                                 SSP1SSPPS2_bit      _BIT_ACCESS(SSP1SSPPS,2)
// SSP1SSPPS<SSP1SSPPS3>
extern volatile __bit                   SSP1SSPPS3          __at(0x75A3);	// @ (0xEB4 * 8 + 3)
#define                                 SSP1SSPPS3_bit      _BIT_ACCESS(SSP1SSPPS,3)
// SSP1SSPPS<SSP1SSPPS4>
extern volatile __bit                   SSP1SSPPS4          __at(0x75A4);	// @ (0xEB4 * 8 + 4)
#define                                 SSP1SSPPS4_bit      _BIT_ACCESS(SSP1SSPPS,4)
// SSP1CLKPPS<SSPCLKPPS0>
extern volatile __bit                   SSPCLKPPS0          __at(0x7590);	// @ (0xEB2 * 8 + 0)
#define                                 SSPCLKPPS0_bit      _BIT_ACCESS(SSP1CLKPPS,0)
// SSP1CLKPPS<SSPCLKPPS1>
extern volatile __bit                   SSPCLKPPS1          __at(0x7591);	// @ (0xEB2 * 8 + 1)
#define                                 SSPCLKPPS1_bit      _BIT_ACCESS(SSP1CLKPPS,1)
// SSP1CLKPPS<SSPCLKPPS2>
extern volatile __bit                   SSPCLKPPS2          __at(0x7592);	// @ (0xEB2 * 8 + 2)
#define                                 SSPCLKPPS2_bit      _BIT_ACCESS(SSP1CLKPPS,2)
// SSP1CLKPPS<SSPCLKPPS3>
extern volatile __bit                   SSPCLKPPS3          __at(0x7593);	// @ (0xEB2 * 8 + 3)
#define                                 SSPCLKPPS3_bit      _BIT_ACCESS(SSP1CLKPPS,3)
// SSP1CLKPPS<SSPCLKPPS4>
extern volatile __bit                   SSPCLKPPS4          __at(0x7594);	// @ (0xEB2 * 8 + 4)
#define                                 SSPCLKPPS4_bit      _BIT_ACCESS(SSP1CLKPPS,4)
// SSP1DATPPS<SSPDATPPS0>
extern volatile __bit                   SSPDATPPS0          __at(0x7598);	// @ (0xEB3 * 8 + 0)
#define                                 SSPDATPPS0_bit      _BIT_ACCESS(SSP1DATPPS,0)
// SSP1DATPPS<SSPDATPPS1>
extern volatile __bit                   SSPDATPPS1          __at(0x7599);	// @ (0xEB3 * 8 + 1)
#define                                 SSPDATPPS1_bit      _BIT_ACCESS(SSP1DATPPS,1)
// SSP1DATPPS<SSPDATPPS2>
extern volatile __bit                   SSPDATPPS2          __at(0x759A);	// @ (0xEB3 * 8 + 2)
#define                                 SSPDATPPS2_bit      _BIT_ACCESS(SSP1DATPPS,2)
// SSP1DATPPS<SSPDATPPS3>
extern volatile __bit                   SSPDATPPS3          __at(0x759B);	// @ (0xEB3 * 8 + 3)
#define                                 SSPDATPPS3_bit      _BIT_ACCESS(SSP1DATPPS,3)
// SSP1DATPPS<SSPDATPPS4>
extern volatile __bit                   SSPDATPPS4          __at(0x759C);	// @ (0xEB3 * 8 + 4)
#define                                 SSPDATPPS4_bit      _BIT_ACCESS(SSP1DATPPS,4)
// SSP1CON1<SSPEN>
extern volatile __bit                   SSPEN               __at(0x7CAD);	// @ (0xF95 * 8 + 5)
#define                                 SSPEN_bit           _BIT_ACCESS(SSP1CON1,5)
// SSP1CON1<SSPEN1>
extern volatile __bit                   SSPEN1              __at(0x7CAD);	// @ (0xF95 * 8 + 5)
#define                                 SSPEN1_bit          _BIT_ACCESS(SSP1CON1,5)
// PIE3<SSPIE>
extern volatile __bit                   SSPIE               __at(0x7600);	// @ (0xEC0 * 8 + 0)
#define                                 SSPIE_bit           _BIT_ACCESS(PIE3,0)
// PIR3<SSPIF>
extern volatile __bit                   SSPIF               __at(0x7640);	// @ (0xEC8 * 8 + 0)
#define                                 SSPIF_bit           _BIT_ACCESS(PIR3,0)
// IPR3<SSPIP>
extern volatile __bit                   SSPIP               __at(0x75C0);	// @ (0xEB8 * 8 + 0)
#define                                 SSPIP_bit           _BIT_ACCESS(IPR3,0)
// SSP1CON1<SSPM0>
extern volatile __bit                   SSPM0               __at(0x7CA8);	// @ (0xF95 * 8 + 0)
#define                                 SSPM0_bit           _BIT_ACCESS(SSP1CON1,0)
// SSP1CON1<SSPM01>
extern volatile __bit                   SSPM01              __at(0x7CA8);	// @ (0xF95 * 8 + 0)
#define                                 SSPM01_bit          _BIT_ACCESS(SSP1CON1,0)
// SSP1CON1<SSPM1>
extern volatile __bit                   SSPM1               __at(0x7CA9);	// @ (0xF95 * 8 + 1)
#define                                 SSPM1_bit           _BIT_ACCESS(SSP1CON1,1)
// SSP1CON1<SSPM11>
extern volatile __bit                   SSPM11              __at(0x7CA9);	// @ (0xF95 * 8 + 1)
#define                                 SSPM11_bit          _BIT_ACCESS(SSP1CON1,1)
// SSP1CON1<SSPM2>
extern volatile __bit                   SSPM2               __at(0x7CAA);	// @ (0xF95 * 8 + 2)
#define                                 SSPM2_bit           _BIT_ACCESS(SSP1CON1,2)
// SSP1CON1<SSPM21>
extern volatile __bit                   SSPM21              __at(0x7CAA);	// @ (0xF95 * 8 + 2)
#define                                 SSPM21_bit          _BIT_ACCESS(SSP1CON1,2)
// SSP1CON1<SSPM3>
extern volatile __bit                   SSPM3               __at(0x7CAB);	// @ (0xF95 * 8 + 3)
#define                                 SSPM3_bit           _BIT_ACCESS(SSP1CON1,3)
// SSP1CON1<SSPM31>
extern volatile __bit                   SSPM31              __at(0x7CAB);	// @ (0xF95 * 8 + 3)
#define                                 SSPM31_bit          _BIT_ACCESS(SSP1CON1,3)
// SSP1CON1<SSPOV>
extern volatile __bit                   SSPOV               __at(0x7CAE);	// @ (0xF95 * 8 + 6)
#define                                 SSPOV_bit           _BIT_ACCESS(SSP1CON1,6)
// SSP1CON1<SSPOV1>
extern volatile __bit                   SSPOV1              __at(0x7CAE);	// @ (0xF95 * 8 + 6)
#define                                 SSPOV1_bit          _BIT_ACCESS(SSP1CON1,6)
// SSP1SSPPS<SSPSSPPS0>
extern volatile __bit                   SSPSSPPS0           __at(0x75A0);	// @ (0xEB4 * 8 + 0)
#define                                 SSPSSPPS0_bit       _BIT_ACCESS(SSP1SSPPS,0)
// SSP1SSPPS<SSPSSPPS1>
extern volatile __bit                   SSPSSPPS1           __at(0x75A1);	// @ (0xEB4 * 8 + 1)
#define                                 SSPSSPPS1_bit       _BIT_ACCESS(SSP1SSPPS,1)
// SSP1SSPPS<SSPSSPPS2>
extern volatile __bit                   SSPSSPPS2           __at(0x75A2);	// @ (0xEB4 * 8 + 2)
#define                                 SSPSSPPS2_bit       _BIT_ACCESS(SSP1SSPPS,2)
// SSP1SSPPS<SSPSSPPS3>
extern volatile __bit                   SSPSSPPS3           __at(0x75A3);	// @ (0xEB4 * 8 + 3)
#define                                 SSPSSPPS3_bit       _BIT_ACCESS(SSP1SSPPS,3)
// SSP1SSPPS<SSPSSPPS4>
extern volatile __bit                   SSPSSPPS4           __at(0x75A4);	// @ (0xEB4 * 8 + 4)
#define                                 SSPSSPPS4_bit       _BIT_ACCESS(SSP1SSPPS,4)
// SSP1STAT<START>
extern volatile __bit                   START               __at(0x7CA3);	// @ (0xF94 * 8 + 3)
#define                                 START_bit           _BIT_ACCESS(SSP1STAT,3)
// SSP1STAT<START1>
extern volatile __bit                   START1              __at(0x7CA3);	// @ (0xF94 * 8 + 3)
#define                                 START1_bit          _BIT_ACCESS(SSP1STAT,3)
// WDTTMR<STATE>
extern volatile __bit                   STATE               __at(0x768A);	// @ (0xED1 * 8 + 2)
#define                                 STATE_bit           _BIT_ACCESS(WDTTMR,2)
// PCON0<STKOVF>
extern volatile __bit                   STKOVF              __at(0x7EBF);	// @ (0xFD7 * 8 + 7)
#define                                 STKOVF_bit          _BIT_ACCESS(PCON0,7)
// STKPTR<STKPTR0>
extern volatile __bit                   STKPTR0             __at(0x7FE0);	// @ (0xFFC * 8 + 0)
#define                                 STKPTR0_bit         _BIT_ACCESS(STKPTR,0)
// STKPTR<STKPTR1>
extern volatile __bit                   STKPTR1             __at(0x7FE1);	// @ (0xFFC * 8 + 1)
#define                                 STKPTR1_bit         _BIT_ACCESS(STKPTR,1)
// STKPTR<STKPTR2>
extern volatile __bit                   STKPTR2             __at(0x7FE2);	// @ (0xFFC * 8 + 2)
#define                                 STKPTR2_bit         _BIT_ACCESS(STKPTR,2)
// STKPTR<STKPTR3>
extern volatile __bit                   STKPTR3             __at(0x7FE3);	// @ (0xFFC * 8 + 3)
#define                                 STKPTR3_bit         _BIT_ACCESS(STKPTR,3)
// STKPTR<STKPTR4>
extern volatile __bit                   STKPTR4             __at(0x7FE4);	// @ (0xFFC * 8 + 4)
#define                                 STKPTR4_bit         _BIT_ACCESS(STKPTR,4)
// STKPTR<STKPTR5>
extern volatile __bit                   STKPTR5             __at(0x7FE5);	// @ (0xFFC * 8 + 5)
#define                                 STKPTR5_bit         _BIT_ACCESS(STKPTR,5)
// PCON0<STKUNF>
extern volatile __bit                   STKUNF              __at(0x7EBE);	// @ (0xFD7 * 8 + 6)
#define                                 STKUNF_bit          _BIT_ACCESS(PCON0,6)
// SSP1STAT<STOP>
extern volatile __bit                   STOP                __at(0x7CA4);	// @ (0xF94 * 8 + 4)
#define                                 STOP_bit            _BIT_ACCESS(SSP1STAT,4)
// SSP1STAT<STOP1>
extern volatile __bit                   STOP1               __at(0x7CA4);	// @ (0xF94 * 8 + 4)
#define                                 STOP1_bit           _BIT_ACCESS(SSP1STAT,4)
// CWG1STR<STRA>
extern volatile __bit                   STRA                __at(0x7A18);	// @ (0xF43 * 8 + 0)
#define                                 STRA_bit            _BIT_ACCESS(CWG1STR,0)
// CWG1STR<STRB>
extern volatile __bit                   STRB                __at(0x7A19);	// @ (0xF43 * 8 + 1)
#define                                 STRB_bit            _BIT_ACCESS(CWG1STR,1)
// CWG1STR<STRC>
extern volatile __bit                   STRC                __at(0x7A1A);	// @ (0xF43 * 8 + 2)
#define                                 STRC_bit            _BIT_ACCESS(CWG1STR,2)
// CWG1STR<STRD>
extern volatile __bit                   STRD                __at(0x7A1B);	// @ (0xF43 * 8 + 3)
#define                                 STRD_bit            _BIT_ACCESS(CWG1STR,3)
// WDTCON0<SWDTEN>
extern volatile __bit                   SWDTEN              __at(0x7668);	// @ (0xECD * 8 + 0)
#define                                 SWDTEN_bit          _BIT_ACCESS(WDTCON0,0)
// TX1STA<SYNC1>
extern volatile __bit                   SYNC1               __at(0x7CEC);	// @ (0xF9D * 8 + 4)
#define                                 SYNC1_bit           _BIT_ACCESS(TX1STA,4)
// PMD0<SYSCMD>
extern volatile __bit                   SYSCMD              __at(0x76E7);	// @ (0xEDC * 8 + 7)
#define                                 SYSCMD_bit          _BIT_ACCESS(PMD0,7)
// T0CON0<T016BIT>
extern volatile __bit                   T016BIT             __at(0x7EA4);	// @ (0xFD4 * 8 + 4)
#define                                 T016BIT_bit         _BIT_ACCESS(T0CON0,4)
// T0CON1<T0ASYNC>
extern volatile __bit                   T0ASYNC             __at(0x7EAC);	// @ (0xFD5 * 8 + 4)
#define                                 T0ASYNC_bit         _BIT_ACCESS(T0CON1,4)
// T0CKIPPS<T0CKIPPS0>
extern volatile __bit                   T0CKIPPS0           __at(0x74F8);	// @ (0xE9F * 8 + 0)
#define                                 T0CKIPPS0_bit       _BIT_ACCESS(T0CKIPPS,0)
// T0CKIPPS<T0CKIPPS1>
extern volatile __bit                   T0CKIPPS1           __at(0x74F9);	// @ (0xE9F * 8 + 1)
#define                                 T0CKIPPS1_bit       _BIT_ACCESS(T0CKIPPS,1)
// T0CKIPPS<T0CKIPPS2>
extern volatile __bit                   T0CKIPPS2           __at(0x74FA);	// @ (0xE9F * 8 + 2)
#define                                 T0CKIPPS2_bit       _BIT_ACCESS(T0CKIPPS,2)
// T0CKIPPS<T0CKIPPS3>
extern volatile __bit                   T0CKIPPS3           __at(0x74FB);	// @ (0xE9F * 8 + 3)
#define                                 T0CKIPPS3_bit       _BIT_ACCESS(T0CKIPPS,3)
// T0CON1<T0CKPS0>
extern volatile __bit                   T0CKPS0             __at(0x7EA8);	// @ (0xFD5 * 8 + 0)
#define                                 T0CKPS0_bit         _BIT_ACCESS(T0CON1,0)
// T0CON1<T0CKPS1>
extern volatile __bit                   T0CKPS1             __at(0x7EA9);	// @ (0xFD5 * 8 + 1)
#define                                 T0CKPS1_bit         _BIT_ACCESS(T0CON1,1)
// T0CON1<T0CKPS2>
extern volatile __bit                   T0CKPS2             __at(0x7EAA);	// @ (0xFD5 * 8 + 2)
#define                                 T0CKPS2_bit         _BIT_ACCESS(T0CON1,2)
// T0CON1<T0CKPS3>
extern volatile __bit                   T0CKPS3             __at(0x7EAB);	// @ (0xFD5 * 8 + 3)
#define                                 T0CKPS3_bit         _BIT_ACCESS(T0CON1,3)
// T0CON1<T0CS0>
extern volatile __bit                   T0CS0               __at(0x7EAD);	// @ (0xFD5 * 8 + 5)
#define                                 T0CS0_bit           _BIT_ACCESS(T0CON1,5)
// T0CON1<T0CS1>
extern volatile __bit                   T0CS1               __at(0x7EAE);	// @ (0xFD5 * 8 + 6)
#define                                 T0CS1_bit           _BIT_ACCESS(T0CON1,6)
// T0CON1<T0CS2>
extern volatile __bit                   T0CS2               __at(0x7EAF);	// @ (0xFD5 * 8 + 7)
#define                                 T0CS2_bit           _BIT_ACCESS(T0CON1,7)
// T0CON0<T0EN>
extern volatile __bit                   T0EN                __at(0x7EA7);	// @ (0xFD4 * 8 + 7)
#define                                 T0EN_bit            _BIT_ACCESS(T0CON0,7)
// T0CON0<T0OUT>
extern volatile __bit                   T0OUT               __at(0x7EA5);	// @ (0xFD4 * 8 + 5)
#define                                 T0OUT_bit           _BIT_ACCESS(T0CON0,5)
// T0CON0<T0OUTPS0>
extern volatile __bit                   T0OUTPS0            __at(0x7EA0);	// @ (0xFD4 * 8 + 0)
#define                                 T0OUTPS0_bit        _BIT_ACCESS(T0CON0,0)
// T0CON0<T0OUTPS1>
extern volatile __bit                   T0OUTPS1            __at(0x7EA1);	// @ (0xFD4 * 8 + 1)
#define                                 T0OUTPS1_bit        _BIT_ACCESS(T0CON0,1)
// T0CON0<T0OUTPS2>
extern volatile __bit                   T0OUTPS2            __at(0x7EA2);	// @ (0xFD4 * 8 + 2)
#define                                 T0OUTPS2_bit        _BIT_ACCESS(T0CON0,2)
// T0CON0<T0OUTPS3>
extern volatile __bit                   T0OUTPS3            __at(0x7EA3);	// @ (0xFD4 * 8 + 3)
#define                                 T0OUTPS3_bit        _BIT_ACCESS(T0CON0,3)
// TMR0H<T0PR0>
extern volatile __bit                   T0PR0               __at(0x7E98);	// @ (0xFD3 * 8 + 0)
#define                                 T0PR0_bit           _BIT_ACCESS(TMR0H,0)
// TMR0H<T0PR1>
extern volatile __bit                   T0PR1               __at(0x7E99);	// @ (0xFD3 * 8 + 1)
#define                                 T0PR1_bit           _BIT_ACCESS(TMR0H,1)
// TMR0H<T0PR2>
extern volatile __bit                   T0PR2               __at(0x7E9A);	// @ (0xFD3 * 8 + 2)
#define                                 T0PR2_bit           _BIT_ACCESS(TMR0H,2)
// TMR0H<T0PR3>
extern volatile __bit                   T0PR3               __at(0x7E9B);	// @ (0xFD3 * 8 + 3)
#define                                 T0PR3_bit           _BIT_ACCESS(TMR0H,3)
// TMR0H<T0PR4>
extern volatile __bit                   T0PR4               __at(0x7E9C);	// @ (0xFD3 * 8 + 4)
#define                                 T0PR4_bit           _BIT_ACCESS(TMR0H,4)
// TMR0H<T0PR5>
extern volatile __bit                   T0PR5               __at(0x7E9D);	// @ (0xFD3 * 8 + 5)
#define                                 T0PR5_bit           _BIT_ACCESS(TMR0H,5)
// TMR0H<T0PR6>
extern volatile __bit                   T0PR6               __at(0x7E9E);	// @ (0xFD3 * 8 + 6)
#define                                 T0PR6_bit           _BIT_ACCESS(TMR0H,6)
// TMR0H<T0PR7>
extern volatile __bit                   T0PR7               __at(0x7E9F);	// @ (0xFD3 * 8 + 7)
#define                                 T0PR7_bit           _BIT_ACCESS(TMR0H,7)
// T0CON1<T0PS0>
extern volatile __bit                   T0PS0               __at(0x7EA8);	// @ (0xFD5 * 8 + 0)
#define                                 T0PS0_bit           _BIT_ACCESS(T0CON1,0)
// T0CON1<T0PS1>
extern volatile __bit                   T0PS1               __at(0x7EA9);	// @ (0xFD5 * 8 + 1)
#define                                 T0PS1_bit           _BIT_ACCESS(T0CON1,1)
// T0CON1<T0PS2>
extern volatile __bit                   T0PS2               __at(0x7EAA);	// @ (0xFD5 * 8 + 2)
#define                                 T0PS2_bit           _BIT_ACCESS(T0CON1,2)
// T0CON1<T0PS3>
extern volatile __bit                   T0PS3               __at(0x7EAB);	// @ (0xFD5 * 8 + 3)
#define                                 T0PS3_bit           _BIT_ACCESS(T0CON1,3)
// T1CKIPPS<T1CKIPPS0>
extern volatile __bit                   T1CKIPPS0           __at(0x7500);	// @ (0xEA0 * 8 + 0)
#define                                 T1CKIPPS0_bit       _BIT_ACCESS(T1CKIPPS,0)
// T1CKIPPS<T1CKIPPS1>
extern volatile __bit                   T1CKIPPS1           __at(0x7501);	// @ (0xEA0 * 8 + 1)
#define                                 T1CKIPPS1_bit       _BIT_ACCESS(T1CKIPPS,1)
// T1CKIPPS<T1CKIPPS2>
extern volatile __bit                   T1CKIPPS2           __at(0x7502);	// @ (0xEA0 * 8 + 2)
#define                                 T1CKIPPS2_bit       _BIT_ACCESS(T1CKIPPS,2)
// T1CKIPPS<T1CKIPPS3>
extern volatile __bit                   T1CKIPPS3           __at(0x7503);	// @ (0xEA0 * 8 + 3)
#define                                 T1CKIPPS3_bit       _BIT_ACCESS(T1CKIPPS,3)
// T1CKIPPS<T1CKIPPS4>
extern volatile __bit                   T1CKIPPS4           __at(0x7504);	// @ (0xEA0 * 8 + 4)
#define                                 T1CKIPPS4_bit       _BIT_ACCESS(T1CKIPPS,4)
// T1CON<T1CKPS0>
extern volatile __bit                   T1CKPS0             __at(0x7E74);	// @ (0xFCE * 8 + 4)
#define                                 T1CKPS0_bit         _BIT_ACCESS(T1CON,4)
// T1CON<T1CKPS1>
extern volatile __bit                   T1CKPS1             __at(0x7E75);	// @ (0xFCE * 8 + 5)
#define                                 T1CKPS1_bit         _BIT_ACCESS(T1CON,5)
// T1CLK<T1CS0>
extern volatile __bit                   T1CS0               __at(0x7E88);	// @ (0xFD1 * 8 + 0)
#define                                 T1CS0_bit           _BIT_ACCESS(T1CLK,0)
// T1CLK<T1CS1>
extern volatile __bit                   T1CS1               __at(0x7E89);	// @ (0xFD1 * 8 + 1)
#define                                 T1CS1_bit           _BIT_ACCESS(T1CLK,1)
// T1CLK<T1CS2>
extern volatile __bit                   T1CS2               __at(0x7E8A);	// @ (0xFD1 * 8 + 2)
#define                                 T1CS2_bit           _BIT_ACCESS(T1CLK,2)
// T1CLK<T1CS3>
extern volatile __bit                   T1CS3               __at(0x7E8B);	// @ (0xFD1 * 8 + 3)
#define                                 T1CS3_bit           _BIT_ACCESS(T1CLK,3)
// T1GCON<T1GE>
extern volatile __bit                   T1GE                __at(0x7E7F);	// @ (0xFCF * 8 + 7)
#define                                 T1GE_bit            _BIT_ACCESS(T1GCON,7)
// T1GCON<T1GGO>
extern volatile __bit                   T1GGO               __at(0x7E7B);	// @ (0xFCF * 8 + 3)
#define                                 T1GGO_bit           _BIT_ACCESS(T1GCON,3)
// T1GCON<T1GGO_NOT_DONE>
extern volatile __bit                   T1GGO_NOT_DONE      __at(0x7E7B);	// @ (0xFCF * 8 + 3)
#define                                 T1GGO_NOT_DONE_bit  _BIT_ACCESS(T1GCON,3)
// T1GCON<T1GGO_nDONE>
extern volatile __bit                   T1GGO_nDONE         __at(0x7E7B);	// @ (0xFCF * 8 + 3)
#define                                 T1GGO_nDONE_bit     _BIT_ACCESS(T1GCON,3)
// T1GCON<T1GPOL>
extern volatile __bit                   T1GPOL              __at(0x7E7E);	// @ (0xFCF * 8 + 6)
#define                                 T1GPOL_bit          _BIT_ACCESS(T1GCON,6)
// T1GPPS<T1GPPS0>
extern volatile __bit                   T1GPPS0             __at(0x7508);	// @ (0xEA1 * 8 + 0)
#define                                 T1GPPS0_bit         _BIT_ACCESS(T1GPPS,0)
// T1GPPS<T1GPPS1>
extern volatile __bit                   T1GPPS1             __at(0x7509);	// @ (0xEA1 * 8 + 1)
#define                                 T1GPPS1_bit         _BIT_ACCESS(T1GPPS,1)
// T1GPPS<T1GPPS2>
extern volatile __bit                   T1GPPS2             __at(0x750A);	// @ (0xEA1 * 8 + 2)
#define                                 T1GPPS2_bit         _BIT_ACCESS(T1GPPS,2)
// T1GPPS<T1GPPS3>
extern volatile __bit                   T1GPPS3             __at(0x750B);	// @ (0xEA1 * 8 + 3)
#define                                 T1GPPS3_bit         _BIT_ACCESS(T1GPPS,3)
// T1GPPS<T1GPPS4>
extern volatile __bit                   T1GPPS4             __at(0x750C);	// @ (0xEA1 * 8 + 4)
#define                                 T1GPPS4_bit         _BIT_ACCESS(T1GPPS,4)
// T1GCON<T1GSPM>
extern volatile __bit                   T1GSPM              __at(0x7E7C);	// @ (0xFCF * 8 + 4)
#define                                 T1GSPM_bit          _BIT_ACCESS(T1GCON,4)
// T1GATE<T1GSS0>
extern volatile __bit                   T1GSS0              __at(0x7E80);	// @ (0xFD0 * 8 + 0)
#define                                 T1GSS0_bit          _BIT_ACCESS(T1GATE,0)
// T1GATE<T1GSS1>
extern volatile __bit                   T1GSS1              __at(0x7E81);	// @ (0xFD0 * 8 + 1)
#define                                 T1GSS1_bit          _BIT_ACCESS(T1GATE,1)
// T1GATE<T1GSS2>
extern volatile __bit                   T1GSS2              __at(0x7E82);	// @ (0xFD0 * 8 + 2)
#define                                 T1GSS2_bit          _BIT_ACCESS(T1GATE,2)
// T1GATE<T1GSS3>
